# TriangulationInterfaceForTriangulatedShellComponent Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TriangulationInterfaceForTriangulatedShellComponent Members
TriangulationInterfaceForTriangulatedShellComponent Class Constructors Methods Properties See Also
---
The TriangulationInterfaceForTriangulatedShellComponent type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TriangulationInterfaceForTriangulatedShellComponent | Constructs an interface object for a TriangulatedShellComponent. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
TriangulationInterfaceForTriangulatedShellComponent Class
Autodesk.Revit.DB Namespace