# IndexPrimitive Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexPrimitive Members
IndexPrimitive Class Methods Properties See Also
---
The IndexPrimitive type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the IndexPrimitive |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
IndexPrimitive Class
Autodesk.Revit.DB.DirectContext3D Namespace