# CentralModelException Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CentralModelException Members
CentralModelException Class Methods Properties See Also
---
The CentralModelException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ApplicationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
CentralModelException Class
Autodesk.Revit.Exceptions Namespace