# FilterNumericLess Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterNumericLess Members
FilterNumericLess Class Constructors Methods Properties See Also
---
The FilterNumericLess type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterNumericLess | Constructs an instance of FilterNumericLess. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterNumericLess Class
Autodesk.Revit.DB Namespace