# SpaceSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpaceSetIterator Properties
SpaceSetIterator Class See Also
---
The SpaceSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
SpaceSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace