# Panel Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Panel Methods
Panel Class See Also
---
The Panel type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FindHostPanel | Finds the id of the host panel (i.e., wall) associated with this panel. If a host panel is present, then it is displayed instead of the curtain panel. |
| GetRefGridLines | This method is used to get the reference gridlines. |

# See Also
Panel Class
Autodesk.Revit.DB Namespace