# ArgumentException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ArgumentException Methods
ArgumentException Class See Also
---
The ArgumentException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ApplicationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
ArgumentException Class
Autodesk.Revit.Exceptions Namespace