# InitialLuminousIntensity Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialLuminousIntensity Properties
InitialLuminousIntensity Class See Also
---
The InitialLuminousIntensity type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Luminosity | The luminosity value. |

# See Also
InitialLuminousIntensity Class
Autodesk.Revit.DB.Lighting Namespace