# IFCConnectedWallData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCConnectedWallData Methods
IFCConnectedWallData Class See Also
---
The IFCConnectedWallData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace