# CategoryNameMapIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CategoryNameMapIterator Methods
CategoryNameMapIterator Class See Also
---
The CategoryNameMapIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the map. |

# See Also
CategoryNameMapIterator Class
Autodesk.Revit.DB Namespace