# SpatialElementGeometryCalculator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementGeometryCalculator Methods
SpatialElementGeometryCalculator Class See Also
---
The SpatialElementGeometryCalculator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CalculateSpatialElementGeometry | Compute the spatial element geometry and returns the boundary face information. |
| CanCalculateGeometry | This indicates whether the input spatial element is a valid one. |
| Dispose |
| GetOptions | The options that control the calculation. |
| IsRoomOrSpace | This indicates whether the input spatial element is a room or a space. |

# See Also
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace