# AssemblyCodeTable Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyCodeTable Members
AssemblyCodeTable Class Methods Properties See Also
---
The AssemblyCodeTable type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAssemblyCodeTable | Returns the AssemblyCodeTable for the specified document. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
AssemblyCodeTable Class
Autodesk.Revit.DB Namespace