# DisabledDisciplineException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DisabledDisciplineException Methods
DisabledDisciplineException Class See Also
---
The DisabledDisciplineException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
DisabledDisciplineException Class
Autodesk.Revit.Exceptions Namespace