# IGetLocalPathForOpenCallback Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IGetLocalPathForOpenCallback Interface
Members See Also
---
The interface used to provide custom support for the "Open (and Unload)" command for Revit Links obtained as external resources.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public interface IGetLocalPathForOpenCallback
```

Visual Basic
---
```text
Public Interface IGetLocalPathForOpenCallback
```

Visual C++
---
```text
public interface class IGetLocalPathForOpenCallback
```

# Remarks
Revit documents that are linked into host documents are read-only. If the user wishes to edit a linked Revit file they can use the "Open (and Unload)" command to unload the link, and automatically load it directly as a top-level, modifiable document (Revit files cannot be edited while they are being used as links). To support this operation for Revit links obtained as external resources, IExternalResourceServer authors should implement this callback. They should return a local path from where Revit can open the linked document for edit. Ideally, this should be a path that is different than the location from where it has been loaded as a link.
Once the user opens a link as a top-level document, they will presumably make changes to it and save it. It is the responsibility of the server to upload whatever changes the user makes so that the version stored on the server remains the most current. Server providers can determine when changes have been made by the user to local file by watching for the DocumentSaved event.
# See Also
IGetLocalPathForOpenCallback Members
Autodesk.Revit.DB Namespace