# ProjectBrowserOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ProjectBrowserOptions Methods
ProjectBrowserOptions Class See Also
---
The ProjectBrowserOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetProjectBrowserOptions | Returns the current Revit instance's ProjectBrowserOptions. |

# See Also
ProjectBrowserOptions Class
Autodesk.Revit.UI Namespace