# ValidateCurveLoopsOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ValidateCurveLoopsOptions Methods
ValidateCurveLoopsOptions Class See Also
---
The ValidateCurveLoopsOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ValidateCurveLoopsOptions Class
Autodesk.Revit.DB Namespace