# ElectricalDemandFactorDefinition Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElectricalDemandFactorDefinition Properties
ElectricalDemandFactorDefinition Class See Also
---
The ElectricalDemandFactorDefinition type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AdditionalLoad | Additional load to be included during demand load calculation. |
| IncludeAdditionalLoad | Should the additional load (if set) be included in demand load calculations. |
| RuleType | The rule type for this demand factor definition. |

# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace