# PDFExportOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PDFExportOptions Methods
PDFExportOptions Class See Also
---
The PDFExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetNamingRule | Gets a copy of the naming rule. |
| IsValidNamingRule | Whether naming rule is valid or not. |
| SetNamingRule | Sets the naming rule. |

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace