# RebarShapeConstraintArcLength Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintArcLength Members
RebarShapeConstraintArcLength Class Constructors Methods Properties See Also
---
The RebarShapeConstraintArcLength type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraintArcLength | Create an arc-length constraint. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
RebarShapeConstraintArcLength Class
Autodesk.Revit.DB.Structure Namespace