# FamilySizeTableColumn Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilySizeTableColumn Methods
FamilySizeTableColumn Class See Also
---
The FamilySizeTableColumn type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetSpecTypeId | Gets the identifier of the spec describing values in the column. |
| GetUnitTypeId | Gets the identifier of the unit quantifying values in the column. |

# See Also
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace