# AreaTag Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaTag Properties
AreaTag Class See Also
---
The AreaTag type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Area | The area that the tag is associated with. |
| AreaTagType | The tag type. |

# See Also
AreaTag Class
Autodesk.Revit.DB Namespace