# RebarContainerIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarContainerIterator Methods
RebarContainerIterator Class See Also
---
The RebarContainerIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
RebarContainerIterator Class
Autodesk.Revit.DB.Structure Namespace