# CurveByPointsArrayIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveByPointsArrayIterator Methods
CurveByPointsArrayIterator Class See Also
---
The CurveByPointsArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
CurveByPointsArrayIterator Class
Autodesk.Revit.DB Namespace