# RibbonItem Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RibbonItem Methods
RibbonItem Class See Also
---
The RibbonItem type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetContextualHelp | Gets the contextual help bound with this control. |
| SetContextualHelp | Sets the contextual help bound with this button. |

# See Also
RibbonItem Class
Autodesk.Revit.UI Namespace