# DockableFrameVisibilityChangedEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DockableFrameVisibilityChangedEventArgs Members
DockableFrameVisibilityChangedEventArgs Class Methods Properties See Also
---
The DockableFrameVisibilityChangedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DockableFrameShown | True if the pane is being shown, false if it is being hidden. |
| PaneId | The identifier for dockable pane. |

# See Also
DockableFrameVisibilityChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace