# Truss Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Truss Properties
Truss Class See Also
---
The Truss type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Curves | Get all the truss curves. |
| Members | Get all the members of truss. |
| TrussType | Retrieve/set an object that represents the type of the truss. |

# See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace