# ComboBoxMemberData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBoxMemberData Members
ComboBoxMemberData Class Constructors Methods Properties See Also
---
The ComboBoxMemberData type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ComboBoxMemberData | Constructs a new instance of ComboBoxMemberData. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GroupName | Gets or sets a group name for the ComboBoxMember. |
| Image | The image shown on the ComboBoxMember. |
| Text | The user-visible text of the ComboBoxMember. |

# See Also
ComboBoxMemberData Class
Autodesk.Revit.UI Namespace