# CorrectionFactorSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CorrectionFactorSetIterator Properties
CorrectionFactorSetIterator Class See Also
---
The CorrectionFactorSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
CorrectionFactorSetIterator Class
Autodesk.Revit.DB.Electrical Namespace