# CurtainGridLine Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurtainGridLine Methods
CurtainGridLine Class See Also
---
The CurtainGridLine type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddAllSegments | All the segments on this grid line will be added. |
| AddMullions | Add mullions on the specified segments of a grid. If any segment already has a mullion, no change is made to that segment. |
| AddSegment | Add a segment based on the specified segment curve of the gridline. |
| RemoveSegment | Remove the segment specified by the input curve. |

# See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace