# FilterStringLessOrEqual Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringLessOrEqual Members
FilterStringLessOrEqual Class Constructors Methods Properties See Also
---
The FilterStringLessOrEqual type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringLessOrEqual | Constructs an instance of FilterStringLessOrEqual. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterStringLessOrEqual Class
Autodesk.Revit.DB Namespace