# ViewPrintingEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewPrintingEventArgs Properties
ViewPrintingEventArgs Class See Also
---
The ViewPrintingEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Index | The index of the view being printed out of the set of all views being printed. |
| TotalViews | The number of all views being printed. |
| View | The view to be printed. |

# See Also
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace