# Workset Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Workset Methods
Workset Class See Also
---
The Workset type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new workset. |

# See Also
Workset Class
Autodesk.Revit.DB Namespace