# WallType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WallType Members
WallType Class Methods Properties See Also
---
The WallType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Function | The wall function. |
| Kind | The nature of the wall. |
| ThermalProperties | The calculated and settable thermal properties of the WallType |
| Width | The overall thickness of this type of wall. |

# See Also
WallType Class
Autodesk.Revit.DB Namespace