# ScheduleSheetInstance Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleSheetInstance Methods
ScheduleSheetInstance Class See Also
---
The ScheduleSheetInstance type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, ElementId, ElementId, XYZ) | Create an instance of a schedule on a sheet. |
| Create(Document, ElementId, ElementId, XYZ, Int32) | Creates an instance of a schedule segment on a sheet. |

# See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace