# DirectShapeTypeOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShapeTypeOptions Methods
DirectShapeTypeOptions Class See Also
---
The DirectShapeTypeOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsEqualTo | Compare this object with the one supplied as argument. Return true if the options specified by both objects are the same. |
| IsValid | Determines whether a DirectShapeTypeOptions is internally consistent (valid). |

# See Also
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace