# Equals Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EdgeEndPoint..::..Equals Method
EdgeEndPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals(EdgeEndPoint) | Determines whether this EdgeEndPoint is equal to another. |

# See Also
EdgeEndPoint Class
EdgeEndPoint Members
Autodesk.Revit.DB Namespace