# WorksharedOperationProgressChangedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharedOperationProgressChangedEventArgs Class
Members See Also
---
The event arguments used by the WorksharedOperationProgressChanged event, this event will be raised when executing following workshared operations.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public class WorksharedOperationProgressChangedEventArgs : RevitAPISingleEventArgs
```

Visual Basic
---
```text
Public Class WorksharedOperationProgressChangedEventArgs _
	Inherits RevitAPISingleEventArgs
```

Visual C++
---
```text
public ref class WorksharedOperationProgressChangedEventArgs : public RevitAPISingleEventArgs
```

# Remarks
# Remarks
For synchronizing with central operation, there are 4 steps. 1) Save to local (before save to central) - Serializes the streams from memory to local disk cache; [!:Autodesk::Revit::DB::Events::DocumentSaveToLocalProgressChangedEventArgs] 2) Reload latest - Downloads the streams from central model on server and merge them into local memory; [!:Autodesk::Revit::DB::Events::DocumentReloadLatestProgressChangedEventArgs] 3) Save to central - Uploads merged streams from local memory to server central model; [!:Autodesk::Revit::DB::Events::DocumentSaveToCentralProgressChangedEventArgs] 4) Save to local (after save to central) - Serializes the merged streams from memory to local disk cache; [!:Autodesk::Revit::DB::Events::DocumentSaveToLocalProgressChangedEventArgs]
For document open operation, just download the model from server and then open it; [!:Autodesk::Revit::DB::Events::CreateRelatedFileProgressChangedEventArgs]
It is NOT recommended to deal with time-consuming work when handling WorksharedOperationProgressChanged event, otherwise it would increase synchronizing with central or model open time.
# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPISingleEventArgs Autodesk.Revit.DB.Events..::..WorksharedOperationProgressChangedEventArgs Autodesk.Revit.DB.Events..::..DataTransferProgressChangedEventArgs Autodesk.Revit.DB.Events..::..DocumentSaveToLocalProgressChangedEventArgs
# See Also
WorksharedOperationProgressChangedEventArgs Members
Autodesk.Revit.DB.Events Namespace