# WireTypeSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireTypeSetIterator Properties
WireTypeSetIterator Class See Also
---
The WireTypeSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
WireTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace