# Connector Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Connector Methods
Connector Class See Also
---
The Connector type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConnectTo | Make connection between two connectors. |
| DisconnectFrom | Remove connection between two connectors. |
| Dispose |
| GetFabricationConnectorInfo | Gets fabrication connectivity information. |
| GetMEPConnectorInfo | Gets MEP connector information. |
| IsConnectedTo | Identifies if the connector is connected to the specified connector. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace