# DGNExportOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DGNExportOptions Methods
DGNExportOptions Class See Also
---
The DGNExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetExportLineweightTable | Gets a copy of the line weight table. |
| GetPredefinedOptions | Returns an instance DGNExportOptions containing settings from a predefined export setup. |
| GetPredefinedSetupNames | Returns a list of names of predefined setups of DGN export options. |
| SetExportLineweightTable | Sets the line weight table to use during export. |

# See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace