# ApplicationEntryPoint Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationEntryPoint Properties
ApplicationEntryPoint Class See Also
---
The ApplicationEntryPoint type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddinFolder | The full path to the Revit Macros module. |

# See Also
ApplicationEntryPoint Class
Autodesk.Revit.DB.Macros Namespace