# StairsLanding Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StairsLanding Properties
StairsLanding Class See Also
---
The StairsLanding type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BaseElevation | The base elevation of the landing. |
| IsAutomaticLanding | True if the landing is an automatic landing, False otherwise. |
| Thickness | The thickness of the landing. |

# See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace