# WireConduitTypeSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireConduitTypeSetIterator Properties
WireConduitTypeSetIterator Class See Also
---
The WireConduitTypeSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
WireConduitTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace