# IExportContext2D Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IExportContext2D Methods
IExportContext2D Interface See Also
---
The IExportContext2D type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OnElementBegin2D | This method marks the beginning of an element to be exported. |
| OnElementEnd2D | This method marks the end of an element being exported. |
| OnFaceEdge2D | This method is called when a Face edge is being output. |
| OnFaceSilhouette2D | This method is called when a Face silhouette is being output. |
# See Also
IExportContext2D Interface
Autodesk.Revit.DB Namespace