# TilePattern Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TilePattern Properties
TilePattern Class See Also
---
The TilePattern type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TilePatternType | The built-in system tile pattern specified by this object. |
| TilesPerSeedNode | Get the number of tiles located at each seed node. |

# See Also
TilePattern Class
Autodesk.Revit.DB Namespace