# DocumentPrintedEventArgs Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentPrintedEventArgs Methods
DocumentPrintedEventArgs Class See Also
---
The DocumentPrintedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetFailedViewElementIds | Returns ElementIds of the views that that failed to print (if any). |
| GetPrintedViewElementIds | Returns ElementIds of the views that printed successfully. |

# See Also
DocumentPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace