# FilterElementIdRule Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterElementIdRule Properties
FilterElementIdRule Class See Also
---
The FilterElementIdRule type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RuleValue | The user-supplied value against which values from a Revit document will be tested. |

# See Also
FilterElementIdRule Class
Autodesk.Revit.DB Namespace