# ConnectorSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectorSetIterator Properties
ConnectorSetIterator Class See Also
---
The ConnectorSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
ConnectorSetIterator Class
Autodesk.Revit.DB Namespace