# FileArgumentNotFoundException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileArgumentNotFoundException Methods
FileArgumentNotFoundException Class See Also
---
The FileArgumentNotFoundException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ArgumentException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
FileArgumentNotFoundException Class
Autodesk.Revit.Exceptions Namespace