# AnalyticalPanel Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalPanel Properties
AnalyticalPanel Class See Also
---
The AnalyticalPanel type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Thickness | Panel thickness, in the Revit default units. |

# See Also
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace