# StructuralSectionRectangularBar Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionRectangularBar Members
StructuralSectionRectangularBar Class Constructors Methods Properties See Also
---
The StructuralSectionRectangularBar type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionRectangularBar | Creates a new instance of Structural Section Rectangular Bar shape with the associated set of parameters, used to attach to structural element. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
StructuralSectionRectangularBar Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace