# ViewExportedEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewExportedEventArgs Members
ViewExportedEventArgs Class Methods Properties See Also
---
The ViewExportedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ViewId | Identifies the view that was exported. |

# See Also
ViewExportedEventArgs Class
Autodesk.Revit.DB.Events Namespace