# ParameterValuePresenceRule Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterValuePresenceRule Members
ParameterValuePresenceRule Class Methods Properties See Also
---
The ParameterValuePresenceRule type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Parameter | The parameter which will be evaluated to pass this rule. |

# See Also
ParameterValuePresenceRule Class
Autodesk.Revit.DB Namespace