# DuctLining Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctLining Methods
DuctLining Class See Also
---
The DuctLining type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of duct lining. |

# See Also
DuctLining Class
Autodesk.Revit.DB.Mechanical Namespace