# TableCellStyleOverrideOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableCellStyleOverrideOptions Methods
TableCellStyleOverrideOptions Class See Also
---
The TableCellStyleOverrideOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| SetAllOverrides | Sets all overrides to a specific value. |

# See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace