# RebarShapeBendAngle Enumeration

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeBendAngle Enumeration
See Also
---
A bend in a rebar shape has an angular range specified by one of these values. The angles refer to the angle swept out by one segment as it is bent relative to another. That is, an "Obtuse" bend results in two segments that meet at an angle that is less than 90 degrees when measured internally. Put another way, to create an equilateral triangle, you would need two "Obtuse" bends.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public enum RebarShapeBendAngle
```

Visual Basic
---
```text
Public Enumeration RebarShapeBendAngle
```

Visual C++
---
```text
public enum class RebarShapeBendAngle
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| Acute | The angle is less than 90 degrees. |
| Right | The angle is 90 degrees. |
| Obtuse | The angle is between 90 and 180 degrees. |

# See Also
Autodesk.Revit.DB.Structure Namespace