# ImageInstance Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImageInstance Methods
ImageInstance Class See Also
---
The ImageInstance type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new ImageInstance element placed in a view. |
| GetLocation | Returns the location of one of the points of the ImageInstance |
| IsValidView | Check that the view is a valid view for ImageInstance elements |
| SetLocation | Moves the ImageInstance to the specified location |

# See Also
ImageInstance Class
Autodesk.Revit.DB Namespace