# PointOnEdge Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointOnEdge Methods
PointOnEdge Class See Also
---
The PointOnEdge type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetEdgeReference | Get a copy of the edge or curve reference. |
| SetEdgeReference | Change the edge or curve reference. |

# See Also
PointOnEdge Class
Autodesk.Revit.DB Namespace