# FaceSplitter Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceSplitter Members
FaceSplitter Class Methods Properties See Also
---
The FaceSplitter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetBoundaries | Gets the boundaries. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SplitElementId | The id of the element whose face is split by this element. |

# See Also
FaceSplitter Class
Autodesk.Revit.DB Namespace