# ExternallyTaggedNonBReps Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedNonBReps Methods
ExternallyTaggedNonBReps Class See Also
---
The ExternallyTaggedNonBReps type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Add | Adds a copy of the input ExternallyTaggedNonBRep to this collection. |
| CanAddExternallyTaggedNonBRep | Checks if the input geometry could be added to this collection or not. |
| Dispose |

# See Also
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace