# IPipeFittingAndAccessoryPressureDropServer Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IPipeFittingAndAccessoryPressureDropServer Methods
IPipeFittingAndAccessoryPressureDropServer Interface See Also
---
The IPipeFittingAndAccessoryPressureDropServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Calculate | Calculate the pipe fitting and pipe accessory coefficient. |
| GetDataSchema | Obtains the schema of the ESEntity. |
| IsApplicable | Check if the server is applicable for the pipe fitting or pipe accessory. |

# See Also
IPipeFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace