# SymbolicCurveArrayIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SymbolicCurveArrayIterator Methods
SymbolicCurveArrayIterator Class See Also
---
The SymbolicCurveArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
SymbolicCurveArrayIterator Class
Autodesk.Revit.DB Namespace