# RebarShapeConstraint Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraint Methods
RebarShapeConstraint Class See Also
---
The RebarShapeConstraint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetParamId | Return the Id of the parameter associated with this constraint. |

# See Also
RebarShapeConstraint Class
Autodesk.Revit.DB.Structure Namespace