# FaceDetailNode Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceDetailNode Methods
FaceDetailNode Class See Also
---
The FaceDetailNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetInstanceTransform | Returns instance transform of the object being drawn. |
| GetLinkTransform | Returns link transform of the object being drawn. |

# See Also
FaceDetailNode Class
Autodesk.Revit.DB Namespace