# IFCAggregateIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCAggregateIterator Methods
IFCAggregateIterator Class See Also
---
The IFCAggregateIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| MoveNext | Increments the iterator to the next object in the IFCAggregate. |
| Reset | Resets the iterator to the beginning of the aggregate. |

# See Also
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace