# CentralFileCommunicationException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CentralFileCommunicationException Methods
CentralFileCommunicationException Class See Also
---
The CentralFileCommunicationException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides CentralModelException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
CentralFileCommunicationException Class
Autodesk.Revit.Exceptions Namespace