# AssetSet Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetSet Methods
AssetSet Class See Also
---
The AssetSet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear |
| Contains |
| Erase |
| ForwardIterator |
| GetEnumerator |
| Insert |
| ReverseIterator |

# See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace