# ViewDisplaySketchyLines Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewDisplaySketchyLines Methods
ViewDisplaySketchyLines Class See Also
---
The ViewDisplaySketchyLines type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace