# FileSaveDialog Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileSaveDialog Members
FileSaveDialog Class Constructors Methods Properties See Also
---
The FileSaveDialog type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FileSaveDialog | Constructs a new instance of a File Save dialog. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InitialFileName | The initial file name to be shown for this save operation. |

# See Also
FileSaveDialog Class
Autodesk.Revit.UI Namespace