# HermiteFace Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HermiteFace Properties
HermiteFace Class See Also
---
The HermiteFace type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MixedDerivs | Mixed derivatives of the surface. |
| Params | Parameters of the surface. |
| Points | Interpolation points of the surface. |
| Tangents | Tangents of the surface. |

# See Also
HermiteFace Class
Autodesk.Revit.DB Namespace