# Level Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Level Properties
Level Class See Also
---
The Level type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Elevation | Retrieves or changes the elevation above or below the ground level. |
| ProjectElevation | Retrieves the elevation relative to project origin, no matter what values of the Elevation Base parameter is set. |

# See Also
Level Class
Autodesk.Revit.DB Namespace