# ComboBoxCurrentChangedEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBoxCurrentChangedEventArgs Properties
ComboBoxCurrentChangedEventArgs Class See Also
---
The ComboBoxCurrentChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NewValue | The current item for the ComboBox after the change. |
| OldValue | The current item for the ComboBox before the change. |

# See Also
ComboBoxCurrentChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace