# ReinforcementSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReinforcementSettings Properties
ReinforcementSettings Class See Also
---
The ReinforcementSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HostStructuralRebar | Host Structural Rebar within Area and Path Reinforcement with touching AtomHostStructuralRebar. |
| NumberVaryingLengthRebarsIndividually | Use this option to modify the way varying length bars are numbered (individually or as a whole). |
| RebarPresentationInSection | The default presentation mode for rebar sets, when: |

  * The view direction is perpendicular to the rebar normal and the rebar set is cut.
  * The view direction is not perpendicular to the rebar normal and the view direction is not parallel to the rebar normal.

| RebarPresentationInView|  The default presentation mode for rebar sets, when the view direction is perpendicular to the rebar normal and the rebar set is not cut.
| RebarShapeDefinesEndTreatments|  End Treatments are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
| RebarShapeDefinesHooks|  Hooks are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
| RebarVaryingLengthNumberSuffix|  A unique identifier used for a bar within a variable length rebar set.
# See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace