# CitySetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CitySetIterator Properties
CitySetIterator Class See Also
---
The CitySetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
CitySetIterator Class
Autodesk.Revit.DB Namespace