# ExportPatternTableIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportPatternTableIterator Methods
ExportPatternTableIterator Class See Also
---
The ExportPatternTableIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
ExportPatternTableIterator Class
Autodesk.Revit.DB Namespace