# StructuralSectionStructuralTees Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionStructuralTees Properties
StructuralSectionStructuralTees Class See Also
---
The StructuralSectionStructuralTees type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BoltDiameter | Maximum bolt hole diameter, in. (mm) |
| BoltSpacing | Standard bolt spacing in the flange, in. (mm) |
| BoltSpacingWeb | Standard bolt spacing in the web, in. (mm) |

# See Also
StructuralSectionStructuralTees Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace