# GetCenterlineCurves Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarInSystem..::..GetCenterlineCurves Method
RebarInSystem Class See Also
---
A chain of curves representing the centerline of the rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<Curve> GetCenterlineCurves(
	bool adjustForSelfIntersection,
	bool suppressHooks,
	bool suppressBendRadius
)
```

Visual Basic
---
```text
Public Function GetCenterlineCurves ( _
	adjustForSelfIntersection As Boolean, _
	suppressHooks As Boolean, _
	suppressBendRadius As Boolean _
) As IList(Of Curve)
```

Visual C++
---
```text
public:
IList<Curve^>^ GetCenterlineCurves(
	bool adjustForSelfIntersection,
	bool suppressHooks,
	bool suppressBendRadius
)
```

# ### Parameters
adjustForSelfIntersection
    Type: System..::..Boolean If the curves overlap, as in a planar stirrup, this parameter controls whether they should be adjusted to avoid intersection (as in fine views), or kept in a single plane for simplicity (as in coarse views).
suppressHooks
    Type: System..::..Boolean Identifies if the chain will include hooks curves.
suppressBendRadius
    Type: System..::..Boolean Identifies if the connected chain will include unfilleted curves.
# ### Return Value
The centerline curves or empty array if the curves cannot be computed because the parameters values are inconsistent with the constraints of the RebarShape definition.
# Remarks
This method will return the centerline curves for the first bar in set even if this bar isn't included.
# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace