# TextBoxData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextBoxData Properties
TextBoxData Class See Also
---
The TextBoxData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Image | The image of the TextBox. |

# See Also
TextBoxData Class
Autodesk.Revit.UI Namespace