# UpdaterInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UpdaterInfo Methods
UpdaterInfo Class See Also
---
The UpdaterInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
UpdaterInfo Class
Autodesk.Revit.DB Namespace