# CurtainGridSetIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurtainGridSetIterator Methods
CurtainGridSetIterator Class See Also
---
The CurtainGridSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
CurtainGridSetIterator Class
Autodesk.Revit.DB Namespace