# WallSweepInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WallSweepInfo Methods
WallSweepInfo Class See Also
---
The WallSweepInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsEqual | Determines if the input object is equivalent to this WallSweepInfo. |

# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace