# ContinuousRail Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ContinuousRail Methods
ContinuousRail Class See Also
---
The ContinuousRail type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetEndExtensionPath | Retrieves the start extension path. |
| GetPath | Retrieves the rail path. |
| GetStartExtensionPath | Retrieves the start extension path. |
| GetSupports | Returns all the railing supports attached to the rail. |

# See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace