# InstanceBinding Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InstanceBinding Members
InstanceBinding Class Constructors Methods Properties See Also
---
The InstanceBinding type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InstanceBinding()()()() | Constructs an empty instance binding. |
| InstanceBinding(CategorySet) | Constructs an instance binding with the set of categories passed. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
InstanceBinding Class
Autodesk.Revit.DB Namespace