# Conduit Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Conduit Methods
Conduit Class See Also
---
The Conduit type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of conduit. |
| IsValidConduitType | Identifies if a conduit type is valid. |

# See Also
Conduit Class
Autodesk.Revit.DB.Electrical Namespace