# BaseImportOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BaseImportOptions Methods
BaseImportOptions Class See Also
---
The BaseImportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetDefaultLengthUnit | Get the default length unit used for importing unitless files. |
| GetLayerSelection | Get all set layers name which user want to import into Revit. |
| SetDefaultLengthUnit | Set the default length unit used for importing unitless files. |
| SetLayerSelection | Set the layers name which user want to import into Revit. |

# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace