# RoutingCriterionBase Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoutingCriterionBase Members
RoutingCriterionBase Class Methods Properties See Also
---
The RoutingCriterionBase type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RoutingCriterionBase |
| IsEqual | Verify if two criteria are the same. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RoutingCriterionBase Class
Autodesk.Revit.DB Namespace