# ReferenceWithContext Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferenceWithContext Methods
ReferenceWithContext Class See Also
---
The ReferenceWithContext type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetInstanceTransform | Gets the transform of the instance. |
| GetReference | Gets the reference of the geometric object. |

# See Also
ReferenceWithContext Class
Autodesk.Revit.DB Namespace