# InsulationType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InsulationType Properties
InsulationType Class See Also
---
The InsulationType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsInUse | Indicate whether the insulation type is in use. |
| Name | Get name of Insulation type.  (Overrides ElementType..::..Name.) |

# See Also
InsulationType Class
Autodesk.Revit.DB.Electrical Namespace