# PathReinSpanSymbol Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PathReinSpanSymbol Methods
PathReinSpanSymbol Class See Also
---
The PathReinSpanSymbol type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of PathReinSpanSymbol in the project. |

# See Also
PathReinSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace