# AnalyticalDistributionNodePropertyData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalDistributionNodePropertyData Members
AnalyticalDistributionNodePropertyData Class Methods Properties See Also
---
The AnalyticalDistributionNodePropertyData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the AnalyticalDistributionNodePropertyData |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| NumberOfPhases | The number of phases. |

# See Also
AnalyticalDistributionNodePropertyData Class
Autodesk.Revit.DB.Electrical Namespace