# BoundingBoxIsInsideFilter Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BoundingBoxIsInsideFilter Properties
BoundingBoxIsInsideFilter Class See Also
---
The BoundingBoxIsInsideFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Tolerance | Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements. |

# See Also
BoundingBoxIsInsideFilter Class
Autodesk.Revit.DB Namespace