# NetworkCommunicationException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NetworkCommunicationException Methods
NetworkCommunicationException Class See Also
---
The NetworkCommunicationException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ApplicationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
NetworkCommunicationException Class
Autodesk.Revit.Exceptions Namespace