# ConduitSize Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConduitSize Methods
ConduitSize Class See Also
---
The ConduitSize type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace