# LinkedResourceOpeningEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinkedResourceOpeningEventArgs Properties
LinkedResourceOpeningEventArgs Class See Also
---
The LinkedResourceOpeningEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LinkedResourcePathName | Path of the linked resource. |
| ResourceType | The desired linked resource type. |

# See Also
LinkedResourceOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace