# InvalidObjectException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InvalidObjectException Methods
InvalidObjectException Class See Also
---
The InvalidObjectException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
InvalidObjectException Class
Autodesk.Revit.Exceptions Namespace