# DuctFittingAndAccessoryConnectorData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctFittingAndAccessoryConnectorData Methods
DuctFittingAndAccessoryConnectorData Class See Also
---
The DuctFittingAndAccessoryConnectorData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCoordination | Gets the coordination of the connector |

# See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace