# ConnectionInputPoint Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectionInputPoint Methods
ConnectionInputPoint Class See Also
---
The ConnectionInputPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace