# FabricationConnectorInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationConnectorInfo Methods
FabricationConnectorInfo Class See Also
---
The FabricationConnectorInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| HasDoubleWallConnector | Checks if there are any double wall connectors fabricated. |
| IsValid | Checks if the connector has fabrication parameters associated with it that can be set. |

# See Also
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace