# ToposolidType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ToposolidType Methods
ToposolidType Class See Also
---
The ToposolidType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetContourSetting | Get the contour setting object from the current toposolid type. |

# See Also
ToposolidType Class
Autodesk.Revit.DB Namespace