# Map Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexBuffer..::..Map Method
VertexBuffer Class See Also
---
Maps a portion of the buffer into memory, so that vertex data can be written into it. (see VertexStream).
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void Map(
	int sizeInFloats
)
```

Visual Basic
---
```text
Public Sub Map ( _
	sizeInFloats As Integer _
)
```

Visual C++
---
```text
public:
void Map(
	int sizeInFloats
)
```

# ### Parameters
sizeInFloats
    Type: System..::..Int32 The size of the part of the buffer to be mapped, measured in floats. Must be less than or equal to the size of the VertexBuffer
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This VertexBuffer is not available because Revit is not currently rendering. In general, this VertexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer. -or- Thrown if the buffer is smaller than sizeInFloats. |

# See Also
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace