# IndexTriangle Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexTriangle Methods
IndexTriangle Class See Also
---
The IndexTriangle type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |

# See Also
IndexTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace