# AnnotationSymbol Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnnotationSymbol Properties
AnnotationSymbol Class See Also
---
The AnnotationSymbol type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnnotationSymbolType | The AnnotationSymbol style of this AnnotationSymbol. |

# See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace