# HermiteSpline Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HermiteSpline Properties
HermiteSpline Class See Also
---
The HermiteSpline type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ControlPoints | The control points of the Hermite spline. |
| IsPeriodic | Returns whether the Hermite spline is periodic or not. |
| Parameters | Returns the params of the Hermite spline. |
| Tangents | Returns the tangents of the Hermite spline. |

# See Also
HermiteSpline Class
Autodesk.Revit.DB Namespace