# DocumentEntryPoint Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentEntryPoint Properties
DocumentEntryPoint Class See Also
---
The DocumentEntryPoint type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddinFolder | The full path to the Revit Macros module. |

# See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace