# MEPFamilyConnectorInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPFamilyConnectorInfo Methods
MEPFamilyConnectorInfo Class See Also
---
The MEPFamilyConnectorInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAssociateFamilyParameterId | Gets the associate family parameter id of the specified connector parameter id. |
| GetConnectorParameterValue | Gets the parameter value of the specified connector parameter id. |

# See Also
MEPFamilyConnectorInfo Class
Autodesk.Revit.DB Namespace