# TransactionAttribute Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TransactionAttribute Properties
TransactionAttribute Class See Also
---
The TransactionAttribute type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Mode | Transaction mode. |

# See Also
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace