# CableTraySettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CableTraySettings Properties
CableTraySettings Class See Also
---
The CableTraySettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConnectorSeparator | The cable tray connector separator string. |
| FittingAnnotationSize | The value of fitting annotation size. |
| RiseDropAnnotationSize | The rise drop annotation size. |
| SizeSeparator | The cable tray size separator string. |
| SizeSuffix | The cable tray size suffix string. |
| UseAnnotationScaleForSingleLineFittings | Indicates whether use annotation scale for single line fittings or not. |

# See Also
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace