# StructuralSectionCProfileWithLips Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionCProfileWithLips Members
StructuralSectionCProfileWithLips Class Constructors Methods Properties See Also
---
The StructuralSectionCProfileWithLips type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionCProfileWithLips | Creates a new instance of Structural Section C Profile With Lips shape with the associated set of parameters, used to attach to structural element. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
StructuralSectionCProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace