# CurtainSystem Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurtainSystem Properties
CurtainSystem Class See Also
---
The CurtainSystem type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurtainGrids | Get all the CurtainGrid object of this CurtainSystem. Each CurtainGrid corresponds to one face. |
| CurtainSystemType | get or set the type of the CurtainSystem. |

# See Also
CurtainSystem Class
Autodesk.Revit.DB Namespace