# Rectangle Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Rectangle Methods
Rectangle Class See Also
---
The Rectangle type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsNormalized | Returns true if the rectangle coordinates are normalized to the screen coordinate space; that is, left is less than right and top is less than bottom. |

# See Also
Rectangle Class
Autodesk.Revit.DB Namespace