# OrdinateDimensionSetting Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
OrdinateDimensionSetting Methods
OrdinateDimensionSetting Class See Also
---
The OrdinateDimensionSetting type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace