# Revolution Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Revolution Properties
Revolution Class See Also
---
The Revolution type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Axis | Returns the Axis of the Revolution. |
| EndAngle | The end angle of the revolution relative to the sketch plane. |
| Sketch | Returns the Sketch of the Revolution. |
| StartAngle | The start angle of the revolution relative to the sketch plane. |

# See Also
Revolution Class
Autodesk.Revit.DB Namespace