# StructuralConnectionType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralConnectionType Properties
StructuralConnectionType Class See Also
---
The StructuralConnectionType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ApplyTo | Choose whether this connection type applies to beams and braces, to tops of columns, or to bases of columns. |

# See Also
StructuralConnectionType Class
Autodesk.Revit.DB.Structure Namespace