# NotTransmittedModelException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NotTransmittedModelException Methods
NotTransmittedModelException Class See Also
---
The NotTransmittedModelException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
NotTransmittedModelException Class
Autodesk.Revit.Exceptions Namespace