# ElementBinding Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementBinding Properties
ElementBinding Class See Also
---
The ElementBinding type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Categories | Retrieve or set the categories to which a parameter definition will be bound. |

# See Also
ElementBinding Class
Autodesk.Revit.DB Namespace