# SpaceSetIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpaceSetIterator Methods
SpaceSetIterator Class See Also
---
The SpaceSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
SpaceSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace