# FormArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FormArray Properties
FormArray Class See Also
---
The FormArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a form at a specified index within the array. |
| Size | Returns the number of forms that are in the array. |

# See Also
FormArray Class
Autodesk.Revit.DB Namespace