# FilteredWorksetIdIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilteredWorksetIdIterator Methods
FilteredWorksetIdIterator Class See Also
---
The FilteredWorksetIdIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | The current workset id found by the iterator. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next workset id passing the filter. |
| Reset | Resets the iterator to the beginning. |

# See Also
FilteredWorksetIdIterator Class
Autodesk.Revit.DB Namespace