# StructuralSectionGeneralCEx Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralCEx Properties
StructuralSectionGeneralCEx Class See Also
---
The StructuralSectionGeneralCEx type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FoldLength | Fold segment length. |
| LipLength | Lip segment length. |

# See Also
StructuralSectionGeneralCEx Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace