# ConnectorSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectorSet Properties
ConnectorSet Class See Also
---
The ConnectorSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of objects that are in the set. |

# See Also
ConnectorSet Class
Autodesk.Revit.DB Namespace