# ComboBoxDropDownClosedEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBoxDropDownClosedEventArgs Members
ComboBoxDropDownClosedEventArgs Class Constructors Methods Properties See Also
---
The ComboBoxDropDownClosedEventArgs type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ComboBoxDropDownClosedEventArgs | Initializes a new instance of the ComboBoxDropDownClosedEventArgs class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ComboBoxDropDownClosedEventArgs Class
Autodesk.Revit.UI.Events Namespace