# Mullion Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Mullion Methods
Mullion Class See Also
---
The Mullion type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BreakMullion | This method is used to break the current Mullion at ends with its neighboring mullions. |
| JoinMullion | This method is used to control the join condition the current Mullion with its neighboring mullions. |

# See Also
Mullion Class
Autodesk.Revit.DB Namespace