# ThermalAsset Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ThermalAsset Methods
ThermalAsset Class See Also
---
The ThermalAsset type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Copy | Produces a copy of the asset. |
| Dispose |
| Equals(ThermalAsset) | Determines whether this thermal asset is equal to another. |
| EqualsThermalOnly | Determines whether this thermal asset is equal to another, but ignore data from base class. |

# See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace