# InvalidPathArgumentException Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InvalidPathArgumentException Members
InvalidPathArgumentException Class Methods Properties See Also
---
The InvalidPathArgumentException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ArgumentException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
InvalidPathArgumentException Class
Autodesk.Revit.Exceptions Namespace