# ReleaseConditions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReleaseConditions Methods
ReleaseConditions Class See Also
---
The ReleaseConditions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ReleaseConditions Class
Autodesk.Revit.DB.Structure Namespace