# RevitServerModelAlreadyExistsException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitServerModelAlreadyExistsException Methods
RevitServerModelAlreadyExistsException Class See Also
---
The RevitServerModelAlreadyExistsException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides RevitServerException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
RevitServerModelAlreadyExistsException Class
Autodesk.Revit.Exceptions Namespace