# FieldDomainPoints Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FieldDomainPoints Members
FieldDomainPoints Class Methods Properties See Also
---
The FieldDomainPoints type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FieldDomainPoints |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FieldDomainPoints Class
Autodesk.Revit.DB.Analysis Namespace