# IFCFileReadOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCFileReadOptions Methods
IFCFileReadOptions Class See Also
---
The IFCFileReadOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace