# CADLinkOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CADLinkOptions Methods
CADLinkOptions Class See Also
---
The CADLinkOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
CADLinkOptions Class
Autodesk.Revit.DB Namespace