# ExternalApplicationArrayIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalApplicationArrayIterator Methods
ExternalApplicationArrayIterator Class See Also
---
The ExternalApplicationArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
ExternalApplicationArrayIterator Class
Autodesk.Revit.UI Namespace