# ViewDisplayDepthCueing Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewDisplayDepthCueing Methods
ViewDisplayDepthCueing Class See Also
---
The ViewDisplayDepthCueing type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| SetStartEndPercentages | Sets start and end percentages. |

# See Also
ViewDisplayDepthCueing Class
Autodesk.Revit.DB Namespace