# MultiServerService Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MultiServerService Methods
MultiServerService Class See Also
---
The MultiServerService type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetActiveServerIds()()()() | Returns Ids of the currently active application-level servers registered for the service. |
| GetActiveServerIds(Document) | Returns Ids of the servers currently applicable to the given document for the service. |
| SetActiveServers(IList<(Of <<'(Guid>)>>)) | Changes the active servers and/or their order. |
| SetActiveServers(IList<(Of <<'(Guid>)>>), Document) | Changes the active servers and/or their order for the given document. |
| SetServerState | This method will simply switch the active state of a server without affecting in any way the other servers. |

# See Also
MultiServerService Class
Autodesk.Revit.DB.ExternalService Namespace