# ElementIdSetFilter Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementIdSetFilter Methods
ElementIdSetFilter Class See Also
---
The ElementIdSetFilter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetIdsToInclude | Returns the ids of this filter. |

# See Also
ElementIdSetFilter Class
Autodesk.Revit.DB Namespace