# RevitServerCollaborationNotAvailableException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitServerCollaborationNotAvailableException Methods
RevitServerCollaborationNotAvailableException Class See Also
---
The RevitServerCollaborationNotAvailableException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides RevitServerException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
RevitServerCollaborationNotAvailableException Class
Autodesk.Revit.Exceptions Namespace