# ViewSheetSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewSheetSet Properties
ViewSheetSet Class See Also
---
The ViewSheetSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsAutomatic | Automatic order or manual order. |
| Name | The view sheet set name. (Overrides Element..::..Name.) |
| OrderedViewList | Ordered views. |
| SheetOrganizationId | ElementId to the BrowserOrganization for sheets. |
| ViewOrganizationId | ElementId to the BrowserOrganization for non-sheet views. |
| Views | The views. |

# See Also
ViewSheetSet Class
Autodesk.Revit.DB Namespace