# WorksetPreview Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksetPreview Methods
WorksetPreview Class See Also
---
The WorksetPreview type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
WorksetPreview Class
Autodesk.Revit.DB Namespace