# DuctFittingAndAccessoryPressureDropData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropData Methods
DuctFittingAndAccessoryPressureDropData Class See Also
---
The DuctFittingAndAccessoryPressureDropData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetDuctFittingAndAccessoryData | Returns the fitting and accessory information. |
| GetPresureDropItems | Returns the pressure drop items. |
| SetDefaultEntity | Stores the default entity in the data. |

# See Also
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace