# RebarShapeConstraintSegmentLength Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintSegmentLength Members
RebarShapeConstraintSegmentLength Class Constructors Methods Properties See Also
---
The RebarShapeConstraintSegmentLength type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraintSegmentLength | Create a segment length constraint. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSegmentEndReferenceType | Choice of two possibilities for the start and end references of the length constraint. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
RebarShapeConstraintSegmentLength Class
Autodesk.Revit.DB.Structure Namespace