# FamilyLoadingIntoDocumentEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyLoadingIntoDocumentEventArgs Properties
FamilyLoadingIntoDocumentEventArgs Class See Also
---
The FamilyLoadingIntoDocumentEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilyName | The file name of the family that is being loaded into the document. |
| FamilyPath | The file path of the family that is being loaded into the document. |

# See Also
FamilyLoadingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace