# OBJImportOptions Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
OBJImportOptions Members
OBJImportOptions Class Constructors Methods Properties See Also
---
The OBJImportOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OBJImportOptions()()()() | Constructs a new instance of OBJImportOptions with default values of all properties. |
| OBJImportOptions(OBJImportOptions) | Constructs a new instance of OBJImportOptions as a copy of the import options. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
OBJImportOptions Class
Autodesk.Revit.DB Namespace