# HemisphericalLightDistribution Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HemisphericalLightDistribution Members
HemisphericalLightDistribution Class Constructors Methods Properties See Also
---
The HemisphericalLightDistribution type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HemisphericalLightDistribution()()()() | Creates a hemispherical light distribution object. |
| HemisphericalLightDistribution(HemisphericalLightDistribution) | Creates a copy of the given hemispherical light distribution |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
HemisphericalLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace