# SlabEdge Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SlabEdge Methods
SlabEdge Class See Also
---
The SlabEdge type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddSegment | Add segments to the slab edge. (Overrides HostedSweep..::..AddSegment(Reference).) |

# See Also
SlabEdge Class
Autodesk.Revit.DB Namespace