# TransferredProjectStandardsEventArgs Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TransferredProjectStandardsEventArgs Methods
TransferredProjectStandardsEventArgs Class See Also
---
The TransferredProjectStandardsEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSelectedExternalItems | Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog. |

# See Also
TransferredProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace