# ElementMulticategoryFilter Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementMulticategoryFilter Members
ElementMulticategoryFilter Class Constructors Methods Properties See Also
---
The ElementMulticategoryFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementMulticategoryFilter(ICollection<(Of <<'(BuiltInCategory>)>>)) | Constructs a new instance of a filter to match elements by built-in category. |
| ElementMulticategoryFilter(ICollection<(Of <<'(ElementId>)>>)) | Constructs a new instance of a filter to find elements whose category matches any of a given set of categories. |
| ElementMulticategoryFilter(ICollection<(Of <<'(BuiltInCategory>)>>), Boolean) | Constructs a new instance of a filter to match elements by built-in category, with the option to match all elements which are not of the given category. |
| ElementMulticategoryFilter(ICollection<(Of <<'(ElementId>)>>), Boolean) | Constructs a new instance of a filter to find elements whose category matches any of a given set of categories, with the option to instead match elements which are not of the given categories. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetCategoryIds | Gets the category ids assigned to this filter. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ElementMulticategoryFilter Class
Autodesk.Revit.DB Namespace