# DoubleParameterValue Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DoubleParameterValue Properties
DoubleParameterValue Class See Also
---
The DoubleParameterValue type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The stored value |

# See Also
DoubleParameterValue Class
Autodesk.Revit.DB Namespace