# GeomCombination Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GeomCombination Members
GeomCombination Class Methods Properties See Also
---
The GeomCombination type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllMembers | All elements that are joined in this geometry combination. |

# See Also
GeomCombination Class
Autodesk.Revit.DB Namespace