# AreaReinforcement Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaReinforcement Properties
AreaReinforcement Class See Also
---
The AreaReinforcement type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AdditionalBottomCoverOffset | Additional offset from the bottom or interior cover reference. |
| AdditionalTopCoverOffset | Additional offset from the top or exterior cover reference. |
| AreaReinforcementType | Retrieves the type of the Area Reinforcement. |
| Direction | Retrieve the Major Direction of the Area Reinforcement. |

# See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace