# PostDocEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PostDocEventArgs Members
PostDocEventArgs Class Methods Properties See Also
---
The PostDocEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | The document associated with the event. |

# See Also
PostDocEventArgs Class
Autodesk.Revit.DB.Events Namespace