# AssetPropertyDouble Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyDouble Members
AssetPropertyDouble Class Methods Properties See Also
---
The AssetPropertyDouble type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidValue | Checks that the value is a valid value for this property. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The value of the property. |

# See Also
AssetPropertyDouble Class
Autodesk.Revit.DB.Visual Namespace