# RelinquishedItems Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RelinquishedItems Methods
RelinquishedItems Class See Also
---
The RelinquishedItems type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetRelinquishedElements | The elements that were relinquished by the current user. |
| GetRelinquishedWorksets | The elements that were relinquished by the current user. |

# See Also
RelinquishedItems Class
Autodesk.Revit.DB Namespace