# AnalysisResultSchema Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisResultSchema Methods
AnalysisResultSchema Class See Also
---
The AnalysisResultSchema type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetNumberOfUnits | returns number of possible units |
| GetUnitsMultiplier | returns units multiplier by index |
| GetUnitsName | returns units name by index |
| IsEqual | Determines if the input object is equivalent to this AnalysisResultSchema. |
| SetUnits | Sets names and multipliers of all units for result visualization |

# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace