# CurveByPoints Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveByPoints Methods
CurveByPoints Class See Also
---
The CurveByPoints type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetPoints | Get the sequence of points interpolated by this curve. |
| GetVisibility | Gets the visibility. |
| SetPoints | Change the sequence of points interpolated by this curve. |
| SetVisibility | Sets the visibility. |
| SortPoints | Order a set of ReferencePoints in the same way Revit does when creating a curve from points. |

# See Also
CurveByPoints Class
Autodesk.Revit.DB Namespace