# BoundaryValidation Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BoundaryValidation Methods
BoundaryValidation Class See Also
---
The BoundaryValidation type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsValidBoundaryOnSketchPlane | Indicates if the given curve loops compose a valid boundary on the sketch plane. |
| IsValidBoundaryOnView | Indicates if the given curve loops compose a valid boundary on the view's detail sketch plane. |
| IsValidHorizontalBoundary | Identifies whether the given curve loops compose a valid horizontal boundary. |

# See Also
BoundaryValidation Class
Autodesk.Revit.DB Namespace