# ViewActivatingEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewActivatingEventArgs Properties
ViewActivatingEventArgs Class See Also
---
The ViewActivatingEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentActiveView | The view that is currently active. |
| NewActiveView | The view that is going to become active. |

# See Also
ViewActivatingEventArgs Class
Autodesk.Revit.UI.Events Namespace