# FamilyTypeSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyTypeSetIterator Properties
FamilyTypeSetIterator Class See Also
---
The FamilyTypeSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
FamilyTypeSetIterator Class
Autodesk.Revit.DB Namespace