# FaceNode Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceNode Methods
FaceNode Class See Also
---
The FaceNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetFace | Returns the Face object corresponding to the node. |

# See Also
FaceNode Class
Autodesk.Revit.DB Namespace