# DockablePaneId Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DockablePaneId Members
DockablePaneId Class Constructors Methods Operators Properties See Also
---
The DockablePaneId type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DockablePaneId | Creates a new DockablePaneId instance. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Compares two DockablePaneId instances. |
| Inequality | Compares two DockablePaneId instances. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
DockablePaneId Class
Autodesk.Revit.UI Namespace