# PhaseFilter Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PhaseFilter Properties
PhaseFilter Class See Also
---
The PhaseFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsDefault | Indicates whether this filter is the default one. |

# See Also
PhaseFilter Class
Autodesk.Revit.DB Namespace