# AssetPropertyDoubleArray4d Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyDoubleArray4d Methods
AssetPropertyDoubleArray4d Class See Also
---
The AssetPropertyDoubleArray4d type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetValueAsColor | Gets the value property as a color. |
| GetValueAsDoubles | Gets the value property as doubles. |
| IsValidValue(IList<(Of <<'(Double>)>>)) | Checks that the value is a valid value for this property. |
| IsValidValue(Color) | Checks that the value is a valid value for this property. |
| SetValueAsColor | Sets the value property as a color. |
| SetValueAsDoubles | Sets the value of the property. |

# See Also
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace