# ColorFillLegend Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorFillLegend Properties
ColorFillLegend Class See Also
---
The ColorFillLegend type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ColorFillCategoryId | Returns the id of color fill category that this legend is created for. |
| Height | The height of the legend. |
| Origin | The top left corner of the color fill legend. |

# See Also
ColorFillLegend Class
Autodesk.Revit.DB Namespace