# AreaVolumeSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaVolumeSettings Methods
AreaVolumeSettings Class See Also
---
The AreaVolumeSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAreaVolumeSettings | Get the area and volume settings of the project. |
| GetSpatialElementBoundaryLocation | Gets the spatial element boundary location based on spatial element type. |
| SetSpatialElementBoundaryLocation | Sets the spatial element boundary location of a spatial element type. |

# See Also
AreaVolumeSettings Class
Autodesk.Revit.DB Namespace