# SaveAsOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SaveAsOptions Methods
SaveAsOptions Class See Also
---
The SaveAsOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetWorksharingOptions | Gets Worksharing options for SaveAs. |
| SetWorksharingOptions | Sets Worksharing options for SaveAs. |

# See Also
SaveAsOptions Class
Autodesk.Revit.DB Namespace