# BackgroundSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BackgroundSettings Methods
BackgroundSettings Class See Also
---
The BackgroundSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
BackgroundSettings Class
Autodesk.Revit.DB Namespace