# GenericForm Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GenericForm Properties
GenericForm Class See Also
---
The GenericForm type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsSolid | Identifies if the GenericForm is a solid or a void element. |
| Name | Get and Set the Name property (Overrides Element..::..Name.) |
| Subcategory | The subcategory. |
| Visible | The visibility of the GenericForm. |

# See Also
GenericForm Class
Autodesk.Revit.DB Namespace