# Build Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..Build Method
TessellatedShapeBuilder Class See Also
---
Builds the designated geometrical objects from the stored face sets. Stores the result in this TessellatedShapeBuilder object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void Build()
```

Visual Basic
---
```text
Public Sub Build
```

Visual C++
---
```text
public:
void Build()
```

# Remarks
The behavior of this function is affected by Target, Fallback and GStyleId properties of this TessellatedShapeBuilder object. Currently only "Solid/Abort", "AnyGeometry/Mesh" and "Mesh/Salvage" target/fallback combinations are supported. Note that this function does not erase the face sets stored in the builder. If the same builder is used to construct geometrical objects for different collections of face sets, (Clear()()()()) should be called while switching from one collection to another.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Throws if data in the stored face sets are so inconsistent, that they cannot be used in their entirety, or if an attempt is made to create unacceptable geometry with too many facets. |

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace