# VertexStreamPositionColored Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexStreamPositionColored Methods
VertexStreamPositionColored Class See Also
---
The VertexStreamPositionColored type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddVertex | Inserts a VertexStreamPositionColored into the stream and associated buffer. |
| AddVertices | Inserts multiple VertexStreamPositionColored instances into the stream and associated buffer. |

# See Also
VertexStreamPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace