# ExecutedEventArgs Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExecutedEventArgs Methods
ExecutedEventArgs Class See Also
---
The ExecutedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetJournalData | Gets the journal data associated to this command (on journal playback). |
| SetJournalData | Sets the journal data associated to this command (on journal playback). |

# See Also
ExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace