# CeilingType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CeilingType Properties
CeilingType Class See Also
---
The CeilingType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ThermalProperties | The calculated and settable thermal properties of the CeilingType |

# See Also
CeilingType Class
Autodesk.Revit.DB Namespace