# ModelText Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModelText Methods
ModelText Class See Also
---
The ModelText type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetVisibility | Gets the visibility for the model text in a family document. |
| SetVisibility | Sets the visibility for the model text in a family document. |

# See Also
ModelText Class
Autodesk.Revit.DB Namespace