# FaceSecondDerivatives Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceSecondDerivatives Methods
FaceSecondDerivatives Class See Also
---
The FaceSecondDerivatives type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
FaceSecondDerivatives Class
Autodesk.Revit.DB Namespace