# DesignOption Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DesignOption Members
DesignOption Class Methods Properties See Also
---
The DesignOption type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetActiveDesignOptionId | Gets the active design option id for the current design option set. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsPrimary | Determines whether this is a primary design option. |

# See Also
DesignOption Class
Autodesk.Revit.DB Namespace