# ViewFamilyType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewFamilyType Properties
ViewFamilyType Class See Also
---
The ViewFamilyType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DefaultTemplateId | The default template id assigned to this view type. |
| PlanViewDirection | The PlanViewDirection of this view. |
| ViewFamily | The ViewFamily for this view type. |

# See Also
ViewFamilyType Class
Autodesk.Revit.DB Namespace