# ArgumentNullException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ArgumentNullException Methods
ArgumentNullException Class See Also
---
The ArgumentNullException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ArgumentException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
ArgumentNullException Class
Autodesk.Revit.Exceptions Namespace