# IExporterIFC Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IExporterIFC Members
IExporterIFC Interface Methods See Also
---
The IExporterIFC type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportIFC | The method that Revit will invoke to perform an export to IFC. |

# See Also
IExporterIFC Interface
Autodesk.Revit.DB.IFC Namespace