# IFCOpeningData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCOpeningData Methods
IFCOpeningData Class See Also
---
The IFCOpeningData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetExtrusionData | Gets extrusion data. |
| GetOpeningSolids | Gets opening solids. |

# See Also
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace