# ChangeType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ChangeType Methods
ChangeType Class See Also
---
The ChangeType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConcatenateChangeTypes | Creates a ChangeType that is a union of the two input ChangeTypes |
| Contains | Checks whether this ChangeType contains the input ChangeType |
| Dispose |
| IsIdentical | Compares if two ChangeTypes are identical |

# See Also
ChangeType Class
Autodesk.Revit.DB Namespace