# FabricWireType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricWireType Members
FabricWireType Class Methods Properties See Also
---
The FabricWireType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateDefaultFabricWireType | Creates a new FabricWireType object with a default name. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BendDiameter | Determines the bending diameter of the wire. |
| WireDiameter | Determines the diameter of the wire. |

# See Also
FabricWireType Class
Autodesk.Revit.DB.Structure Namespace