# GenericZone Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GenericZone Methods
GenericZone Class See Also
---
The GenericZone type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of a generic zone and adds it to the document. |
| GetBoundaries | Gets the boundaries for the generic zone. |
| GetDomainData | Gets the domain data for the generic zone. |

# See Also
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace