# ExtrusionAnalyzer Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExtrusionAnalyzer Methods
ExtrusionAnalyzer Class See Also
---
The ExtrusionAnalyzer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CalculateFaceAlignment | Calculates the alignment status of each face of the solid. |
| Create | Creates an ExtrusionAnalyzer and computes and stores the solid's shadow. |
| Dispose |
| GetExtrusionBase | Obtains the face that represents the base contour of the extrusion analysis. |

# See Also
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace