# ReferencePointArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferencePointArray Properties
ReferencePointArray Class See Also
---
The ReferencePointArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a reference at a specified index within the array. |
| Size | Returns the number of references that are in the array. |

# See Also
ReferencePointArray Class
Autodesk.Revit.DB Namespace