# LightShape Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LightShape Methods
LightShape Class See Also
---
The LightShape type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Creates a copy of the LightShape derived object. |
| Dispose |

# See Also
LightShape Class
Autodesk.Revit.DB.Lighting Namespace