# ElectricalAnalyticalLoadSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElectricalAnalyticalLoadSet Properties
ElectricalAnalyticalLoadSet Class See Also
---
The ElectricalAnalyticalLoadSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| QuantityOnStandBy | The number of Equipment Loads that are not operational at any time. |
| TotalQuantity | The total count of the Equipment Loads in the LoadSet. |

# See Also
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace