# HermiteFace Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HermiteFace Members
HermiteFace Class Methods Properties See Also
---
The HermiteFace type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MixedDerivs | Mixed derivatives of the surface. |
| Params | Parameters of the surface. |
| Points | Interpolation points of the surface. |
| Tangents | Tangents of the surface. |

# See Also
HermiteFace Class
Autodesk.Revit.DB Namespace