# Units Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Units Methods
Units Class See Also
---
The Units type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetFormatOptions | Gets the default FormatOptions for a spec. |
| GetModifiableSpecs | Gets all specs for which the default FormatOptions can be modified. |
| IsModifiableSpec | Checks whether the default FormatOptions can be modified for a given spec. |
| SetFormatOptions | Sets the default FormatOptions for a spec. |

# See Also
Units Class
Autodesk.Revit.DB Namespace