# SystemZoneData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SystemZoneData Properties
SystemZoneData Class See Also
---
The SystemZoneData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ZoneEquipmentId | The id of the zone equipment related to the zone. |

# See Also
SystemZoneData Class
Autodesk.Revit.DB.Mechanical Namespace