# RebarShapeConstraint180DegreeBendRadius Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraint180DegreeBendRadius Members
RebarShapeConstraint180DegreeBendRadius Class Constructors Methods Properties See Also
---
The RebarShapeConstraint180DegreeBendRadius type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraint180DegreeBendRadius | Create a 180-degree bend constraint driven by radius. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ArcReferenceType | A choice of rule for measuring the radius. |

# See Also
RebarShapeConstraint180DegreeBendRadius Class
Autodesk.Revit.DB.Structure Namespace