# DuctLiningType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctLiningType Members
DuctLiningType Class Methods Properties See Also
---
The DuctLiningType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidRoughness | Identifies if the input roughness is valid. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Roughness | The roughness of Duct Lining. |

# See Also
DuctLiningType Class
Autodesk.Revit.DB.Mechanical Namespace