# RadioButtonGroupData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RadioButtonGroupData Members
RadioButtonGroupData Class Constructors Methods Properties See Also
---
The RadioButtonGroupData type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RadioButtonGroupData | Constructs a new instance of RadioButtonGroupData. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
RadioButtonGroupData Class
Autodesk.Revit.UI Namespace