# LayoutRuleMaximumSpacing Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LayoutRuleMaximumSpacing Members
LayoutRuleMaximumSpacing Class Constructors Methods Properties See Also
---
The LayoutRuleMaximumSpacing type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LayoutRuleMaximumSpacing | Constructor of LayoutRuleMaximumSpacing. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Spacing | Get or set the spacing of the beam system. |

# See Also
LayoutRuleMaximumSpacing Class
Autodesk.Revit.DB Namespace