# CentralModelVersionArchivedException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CentralModelVersionArchivedException Methods
CentralModelVersionArchivedException Class See Also
---
The CentralModelVersionArchivedException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides CentralModelException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
CentralModelVersionArchivedException Class
Autodesk.Revit.Exceptions Namespace