# SolidOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SolidOptions Methods
SolidOptions Class See Also
---
The SolidOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
SolidOptions Class
Autodesk.Revit.DB Namespace