# AssemblyMemberDifference Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyMemberDifference Methods
AssemblyMemberDifference Class See Also
---
The AssemblyMemberDifference type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
AssemblyMemberDifference Class
Autodesk.Revit.DB Namespace