# MEPAnalyticalConnectionType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalConnectionType Properties
MEPAnalyticalConnectionType Class See Also
---
The MEPAnalyticalConnectionType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PressureLoss | The pressure loss of this analytical connection type. |

# See Also
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace