# SATImportOptions Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SATImportOptions Members
SATImportOptions Class Constructors Methods Properties See Also
---
The SATImportOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SATImportOptions()()()() | Constructs a new instance of SATImportOptions with default values of all properties. |
| SATImportOptions(SATImportOptions) | Constructs a new instance of SATImportOptions as a copy of the import options. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
SATImportOptions Class
Autodesk.Revit.DB Namespace