# GeometryObject Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GeometryObject Methods
GeometryObject Class See Also
---
The GeometryObject type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Gets the integer value of the geometry object as hash code  (Overrides Object..::..GetHashCode()()()().) |

# See Also
GeometryObject Class
Autodesk.Revit.DB Namespace