# FilteredElementIdIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilteredElementIdIterator Methods
FilteredElementIdIterator Class See Also
---
The FilteredElementIdIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | The current element id found by the iterator. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next element id passing the filter. |
| Reset | Resets the iterator to the beginning. |

# See Also
FilteredElementIdIterator Class
Autodesk.Revit.DB Namespace