# IFCGuidKey Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCGuidKey Methods
IFCGuidKey Class See Also
---
The IFCGuidKey type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether this IFCGuidKey is equal to another.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Returns the hash code for this IFCGuidKey  (Overrides Object..::..GetHashCode()()()().) |

# See Also
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace