# BasicFileInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BasicFileInfo Methods
BasicFileInfo Class See Also
---
The BasicFileInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Extract | Returns an instance of BasicFileInfo filled with basic information about a Revit file located at the given file-path |
| GetDocumentVersion | Gets the DocumentVersion for the file. |

# See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace