# ElementOwnerViewFilter Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementOwnerViewFilter Properties
ElementOwnerViewFilter Class See Also
---
The ElementOwnerViewFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ViewId | The view id. |

# See Also
ElementOwnerViewFilter Class
Autodesk.Revit.DB Namespace