# DuctFittingAndAccessoryData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctFittingAndAccessoryData Methods
DuctFittingAndAccessoryData Class See Also
---
The DuctFittingAndAccessoryData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetAllConnectorData | Gets the connector data of the pipe fitting or pipe accessory. |
| GetEntity | Returns an Entity of the Schema of the serverGUID. or an invalid entity otherwise. |
| GetFamilyInstanceId | Gets the Id of the fiting or accessory instance |

# See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace