# FamilyTypeSetIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyTypeSetIterator Methods
FamilyTypeSetIterator Class See Also
---
The FamilyTypeSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
FamilyTypeSetIterator Class
Autodesk.Revit.DB Namespace