# SymbolicCurveArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SymbolicCurveArray Properties
SymbolicCurveArray Class See Also
---
The SymbolicCurveArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a model curve at a specified index within the array. |
| Size | Returns the number of model curves that are in the array. |

# See Also
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace