# RebarShapeVertex Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeVertex Methods
RebarShapeVertex Class See Also
---
The RebarShapeVertex type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetConstraints | Retrieve the list of constraints associated with this vertex. |
| SetConstraints | Assign a new list of constraints to this vertex. |

# See Also
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace