# StructuralSectionGeneralU Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralU Methods
StructuralSectionGeneralU Class See Also
---
The StructuralSectionGeneralU type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetFlangeThicknessInFlangeCenter | Returns thickness of flange measured in the 0.5 * (width - webThickess), sometimes used for sections with width > 300 mm. |
| GetFlangeThicknessInWidthCenter | Returns thickness of flange measured in the 0.5 * width, sometimes used for sections with width <= 300 mm. |

# See Also
StructuralSectionGeneralU Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace