# ConceptualSurfaceType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConceptualSurfaceType Methods
ConceptualSurfaceType Class See Also
---
The ConceptualSurfaceType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAllMassSubCategoryIds | Get all the mass subcategory ids for which there are ConceptualSurfaceType's. |
| GetByMassSubCategoryId | Get the ConceptualSurfaceType by its mass subcategory id. |
| GetConstructionTypeIds | The element ids of the ConceptualConstructionType's associated with this ConceptualSurfaceType. |

# See Also
ConceptualSurfaceType Class
Autodesk.Revit.DB.Analysis Namespace