# IDuctPressureDropServer Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IDuctPressureDropServer Methods
IDuctPressureDropServer Interface See Also
---
The IDuctPressureDropServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Calculate | Calculate the duct pressure drop. |
| GetHtmlDescription | The method that Revit will invoke to get an HTML formatted description of the server. |
| GetInformationLink | The method that Revit will invoke to obtain a URL address which provides more information about the server. |

# See Also
IDuctPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace