# DirectShape Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShape Properties
DirectShape Class See Also
---
The DirectShape type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ApplicationDataId | A text string that identifies the data to the creating application. |
| ApplicationId | A text string that identifies the creating application. |
| TypeId | Element id of a DirectShapeType object that holds properties to be shared by this element. Optional. |

# See Also
DirectShape Class
Autodesk.Revit.DB Namespace