# GeometryInstance Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GeometryInstance Properties
GeometryInstance Class See Also
---
The GeometryInstance type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SymbolGeometry | The geometric representation of the symbol which generates this instance. |
| Transform | The affine transformation from the local coordinate space of the symbol into the coordinate space of the instance. |

# See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace