# FamilyType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyType Properties
FamilyType Class See Also
---
The FamilyType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Name | The name of the family type. |

# See Also
FamilyType Class
Autodesk.Revit.DB Namespace