# AssetPropertyEnum Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyEnum Methods
AssetPropertyEnum Class See Also
---
The AssetPropertyEnum type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidValue | Checks that the value is a valid value for this property. |

# See Also
AssetPropertyEnum Class
Autodesk.Revit.DB.Visual Namespace