# FabricAreaType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricAreaType Methods
FabricAreaType Class See Also
---
The FabricAreaType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateDefaultFabricAreaType | Creates a new FabricAreaType object with a default name. |

# See Also
FabricAreaType Class
Autodesk.Revit.DB.Structure Namespace