# ZoneElementDomainData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ZoneElementDomainData Members
ZoneElementDomainData Class Methods Properties See Also
---
The ZoneElementDomainData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ZoneElementDomainData |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ZoneElementDomainData Class
Autodesk.Revit.DB.Mechanical Namespace