# LayoutRuleClearSpacing Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LayoutRuleClearSpacing Properties
LayoutRuleClearSpacing Class See Also
---
The LayoutRuleClearSpacing type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| JustifyType | Get or set the type of justification. |
| Spacing | Get or set the spacing of the beam system. |

# See Also
LayoutRuleClearSpacing Class
Autodesk.Revit.DB Namespace