# StructuralSectionRoundHSS Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionRoundHSS Members
StructuralSectionRoundHSS Class Constructors Methods Properties See Also
---
The StructuralSectionRoundHSS type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionRoundHSS | Creates a new instance of Structural Section Round HSS shape with the associated set of parameters, used to attach to structural element. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
StructuralSectionRoundHSS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace