# AnalyticalMember Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalMember Properties
AnalyticalMember Class See Also
---
The AnalyticalMember type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CrossSectionRotation | This represents the cross-section rotation, in radians. |
| SectionTypeId | The id of the type from the structural Family assigned to the Analytical Member. |
| StructuralSectionShape | The structural section shape of the Analytical Member. |

# See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace