# HVACLoadBuildingType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HVACLoadBuildingType Properties
HVACLoadBuildingType Class See Also
---
The HVACLoadBuildingType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BuildingTypeName | The building type name. |
| ClosingTime | The closing time of the building type. |
| OpeningTime | The opening time of the building type. |
| UnoccupiedCoolingSetPoint | The unoccupied cooling set point of the building type with unit kelvin (K). |

# See Also
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace