# LoadUsage Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadUsage Members
LoadUsage Class Methods Properties See Also
---
The LoadUsage type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new LoadUsage. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
LoadUsage Class
Autodesk.Revit.DB.Structure Namespace