# WireConduitTypeSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireConduitTypeSet Properties
WireConduitTypeSet Class See Also
---
The WireConduitTypeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of conduit types that are in the set. |

# See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace