# DocumentEntryPoint Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentEntryPoint Methods
DocumentEntryPoint Class See Also
---
The DocumentEntryPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FinishInitializationEO | For Revit Macros internal use only. |
| Initialize | For Revit Macros internal use only. |
| OnShutdownEO | For Revit Macros internal use only. |

# See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace