# SteelElementProperties Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SteelElementProperties Methods
SteelElementProperties Class See Also
---
The SteelElementProperties type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddFabricationInformationForRevitElements | This method adds fabrication information to the given elements. |
| GetFabricationUniqueID | This method will return the fabrication id for the given reference. |
| GetReference | This method will return the reference for the given fabrication id. |
| GetSteelElementProperties | Get SteelElementProperties for the input element if they exist. |

# See Also
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace