# AssetPropertyInteger Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyInteger Members
AssetPropertyInteger Class Methods Properties See Also
---
The AssetPropertyInteger type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidValue | Checks that the value is a valid value for this property. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The value of the property. |

# See Also
AssetPropertyInteger Class
Autodesk.Revit.DB.Visual Namespace