# NestedFamilyTypeReference Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NestedFamilyTypeReference Properties
NestedFamilyTypeReference Class See Also
---
The NestedFamilyTypeReference type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CategoryId | Category Id of the referenced family |
| FamilyName | Name of the referenced family |
| TypeName | Type of the referenced family |

# See Also
NestedFamilyTypeReference Class
Autodesk.Revit.DB Namespace