# OperationCanceledException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
OperationCanceledException Methods
OperationCanceledException Class See Also
---
The OperationCanceledException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ApplicationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
OperationCanceledException Class
Autodesk.Revit.Exceptions Namespace