# WireConduitType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireConduitType Members
WireConduitType Class Methods Properties See Also
---
The WireConduitType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Name |

# See Also
WireConduitType Class
Autodesk.Revit.DB.Electrical Namespace