# MEPAnalyticalConnectionType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalConnectionType Methods
MEPAnalyticalConnectionType Class See Also
---
The MEPAnalyticalConnectionType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates an analytical connection type element. |
| FindTypeByName | Finds the analytical connection type by its name. |
| IsNameUnused | Checks if this is an unused name. |

# See Also
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace