# IATFTranslationServer Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IATFTranslationServer Methods
IATFTranslationServer Interface See Also
---
The IATFTranslationServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Translate | Translate a model according to translationData settings |

# See Also
IATFTranslationServer Interface
Autodesk.Revit.DB Namespace