# PaperSourceSetIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PaperSourceSetIterator Methods
PaperSourceSetIterator Class See Also
---
The PaperSourceSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
PaperSourceSetIterator Class
Autodesk.Revit.DB Namespace