# AddInIdAttribute Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AddInIdAttribute Members
AddInIdAttribute Class Constructors Methods Properties See Also
---
The AddInIdAttribute type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddInIdAttribute | Constructs a new AddInIdAttribute. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | AddInId guid value. |

# See Also
AddInIdAttribute Class
Autodesk.Revit.DB.Macros Namespace