# PointRelativeToPoint Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointRelativeToPoint Methods
PointRelativeToPoint Class See Also
---
The PointRelativeToPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetHostPointReference | Get a copy of the host point reference. |
| SetHostPointReference | Change the host point reference. |

# See Also
PointRelativeToPoint Class
Autodesk.Revit.DB Namespace