# Camera Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Camera Methods
Camera Class See Also
---
The Camera type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Transform | Transforms the camera |

# See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace