# ViewNavigationToolSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewNavigationToolSettings Methods
ViewNavigationToolSettings Class See Also
---
The ViewNavigationToolSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetHomeCamera | Gets a copy of the structure containing information about the store Home view orientation. |
| GetViewNavigationToolSettings | Gets the instance of the settings for the given document. |
| IsHomeCameraSet | Checks if the home view is set in the settings. |

# See Also
ViewNavigationToolSettings Class
Autodesk.Revit.DB Namespace