# SpatialElementGeometryResults Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementGeometryResults Methods
SpatialElementGeometryResults Class See Also
---
The SpatialElementGeometryResults type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetBoundaryFaceInfo | Query the spatial element boundary face information with the given face. |
| GetGeometry | The solid from the spatial element. |

# See Also
SpatialElementGeometryResults Class
Autodesk.Revit.DB Namespace