# ExtrusionRoof Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExtrusionRoof Members
ExtrusionRoof Class Methods Properties See Also
---
The ExtrusionRoof type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetProfile | Retrieve the Profile of ExtrusionRoof. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurtainGrids | Retrieve all the CurtainGrid objects of a curtain Roof. |

# See Also
ExtrusionRoof Class
Autodesk.Revit.DB Namespace