# CustomExporter Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CustomExporter Methods
CustomExporter Class See Also
---
The CustomExporter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Export(IList<(Of <<'(ElementId>)>>)) | Exports a collection of 3D or 2D views |
| Export(View) | Exports one 3D or 2D view |
| IsRenderingSupported | Checks if view rendering is currently supported in the running instance of Revit. |

# See Also
CustomExporter Class
Autodesk.Revit.DB Namespace