# DocumentReloadLatestProgressChangedEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentReloadLatestProgressChangedEventArgs Properties
DocumentReloadLatestProgressChangedEventArgs Class See Also
---
The DocumentReloadLatestProgressChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsMerging | Indicates if it is merging downloaded data. |
| ReloadLatestFinished | Indicates if current 'reload latest' progress is finished. |
| RetryTimes | The number of times Revit has tried to Reload Latest. Its value is '0' at the first time. |

# See Also
DocumentReloadLatestProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace