# OptionalFunctionalityNotAvailableException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
OptionalFunctionalityNotAvailableException Methods
OptionalFunctionalityNotAvailableException Class See Also
---
The OptionalFunctionalityNotAvailableException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
OptionalFunctionalityNotAvailableException Class
Autodesk.Revit.Exceptions Namespace