# AssetPropertyBoolean Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyBoolean Members
AssetPropertyBoolean Class Methods Properties See Also
---
The AssetPropertyBoolean type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The value of the property. |

# See Also
AssetPropertyBoolean Class
Autodesk.Revit.DB.Visual Namespace