# ClipPlane Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ClipPlane Methods
ClipPlane Class See Also
---
The ClipPlane type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ClipPlane Class
Autodesk.Revit.DB.DirectContext3D Namespace