# ClassificationEntries Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ClassificationEntries Members
ClassificationEntries Class Methods Properties See Also
---
The ClassificationEntries type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LoadClassificationEntriesFromFile | Loads the contents of a classification text file into the provided KeyBasedTreeEntriesLoadContent. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ClassificationEntries Class
Autodesk.Revit.DB Namespace