# TaskDialogShowingEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TaskDialogShowingEventArgs Properties
TaskDialogShowingEventArgs Class See Also
---
The TaskDialogShowingEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Message | The message that has been displayed in the dialog box. |

# See Also
TaskDialogShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace