# CategorySetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CategorySetIterator Properties
CategorySetIterator Class See Also
---
The CategorySetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
CategorySetIterator Class
Autodesk.Revit.DB Namespace