# MultipleValuesIndicationSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MultipleValuesIndicationSettings Properties
MultipleValuesIndicationSettings Class See Also
---
The MultipleValuesIndicationSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Custom | If true, CustomValue is used as multiple values indication, otherwise a hardcoded standard value. |
| CustomValue | Value used as multiple values indication if Custom is set to true. |
| Value | Value to be used as multiple values indication in the document. If Custom is true, returns CustomValue, otherwise returns a hardcoded standard value. |

# See Also
MultipleValuesIndicationSettings Class
Autodesk.Revit.DB Namespace