# WireSizeSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireSizeSetIterator Properties
WireSizeSetIterator Class See Also
---
The WireSizeSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
WireSizeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace