# FilterNumericEquals Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterNumericEquals Members
FilterNumericEquals Class Constructors Methods Properties See Also
---
The FilterNumericEquals type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterNumericEquals | Constructs an instance of FilterNumericEquals. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterNumericEquals Class
Autodesk.Revit.DB Namespace