# DocumentCreatingEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentCreatingEventArgs Members
DocumentCreatingEventArgs Class Methods Properties See Also
---
The DocumentCreatingEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DocumentType | Type of the document which is about to be created, e.g. Project or Template. |
| Template | The template file path to be used for creating the new document. |

# See Also
DocumentCreatingEventArgs Class
Autodesk.Revit.DB.Events Namespace