# EditorInteractionType Enumeration

---
C#Visual BasicVisual C++
Revit 2024 API
---
EditorInteractionType Enumeration
See Also
---
Defines the type of interactions a pane has with the active editor when it becomes active in the Revit UI.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 **Since:** 2017
# Syntax
C#
---
```text
public enum EditorInteractionType
```

Visual Basic
---
```text
Public Enumeration EditorInteractionType
```

Visual C++
---
```text
public enum class EditorInteractionType
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| Dismiss | Dismiss the active editor during pane activation. This results in the current selection being cleared and the editor canceled. One example built-in dockable pane that uses this mode is the Revit Project Browser. |
| KeepAlive | Keeps the active editor alive during pane activation. This results in the current selection being kept active and available to the pane. One example built-in dockable pane that uses this mode is the Revit Property Palette. |

# See Also
Autodesk.Revit.UI Namespace