# CurveByPointsArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveByPointsArray Properties
CurveByPointsArray Class See Also
---
The CurveByPointsArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a curve at a specified index within the array. |
| Size | Returns the number of curves that are in the array. |

# See Also
CurveByPointsArray Class
Autodesk.Revit.DB Namespace