# ReferenceArrayArrayIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferenceArrayArrayIterator Properties
ReferenceArrayArrayIterator Class See Also
---
The ReferenceArrayArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
ReferenceArrayArrayIterator Class
Autodesk.Revit.DB Namespace