# Panel Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Panel Properties
Panel Class See Also
---
The Panel type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Lockable | This property is used to know whether a panel can be locked. |
| PanelType | The Panel style of this Panel. |
| Transform | This property is used to find the transform of a curtain panel within project. |

# See Also
Panel Class
Autodesk.Revit.DB Namespace