# RegisterFailuresProcessor Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ControlledApplication..::..RegisterFailuresProcessor Method
ControlledApplication Class See Also
---
Replaces Revit's default user interface (if present) with alternative handling for all warnings and errors (including those not generated by your application) for the rest of the Revit session; if your application is not prepared to respond to all warnings and errors, consider use of IFailuresPreprocessor (in your opened Transaction) or the FailuresProcessing event instead of this interface.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static void RegisterFailuresProcessor(
	IFailuresProcessor processor
)
```

Visual Basic
---
```text
Public Shared Sub RegisterFailuresProcessor ( _
	processor As IFailuresProcessor _
)
```

Visual C++
---
```text
public:
static void RegisterFailuresProcessor(
	IFailuresProcessor^ processor
)
```

# ### Parameters
processor
    Type: Autodesk.Revit.DB..::..IFailuresProcessor Instance of Failures Processor to be used by the Revit Application.
# Remarks
If there is previously registered Failures Processor, it gets discarded. If you opt to register a FailuresProcessor for Revit, your processor will become the default error handler for all Revit errors for the session. The standard Revit error dialog will not appear.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace