# PreviewControl Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PreviewControl Properties
PreviewControl Class See Also
---
The PreviewControl type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ScrollbarVisibility | The visibility of the preview view scrollbars. |
| UIView | The UI view representing the preview view. |
| ViewId | The view Id. |

# See Also
PreviewControl Class
Autodesk.Revit.UI Namespace