# RevitServerUnauthenticatedUserException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitServerUnauthenticatedUserException Methods
RevitServerUnauthenticatedUserException Class See Also
---
The RevitServerUnauthenticatedUserException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides RevitServerException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
RevitServerUnauthenticatedUserException Class
Autodesk.Revit.Exceptions Namespace