# Line Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Line Properties
Line Class See Also
---
The Line type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Direction | Returns the direction of the line. |
| Origin | Returns the origin of the line. |

# See Also
Line Class
Autodesk.Revit.DB Namespace