# RebarShapeConstraintFixedSegmentDir Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintFixedSegmentDir Members
RebarShapeConstraintFixedSegmentDir Class Constructors Methods Properties See Also
---
The RebarShapeConstraintFixedSegmentDir type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraintFixedSegmentDir | Create a fixed segment direction constraint. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Direction | The direction of the RebarShapeSegment in UV-space. |

# See Also
RebarShapeConstraintFixedSegmentDir Class
Autodesk.Revit.DB.Structure Namespace