# GuidEnum Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GuidEnum Methods
GuidEnum Class See Also
---
The GuidEnum type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Compares two Guid-based enum object based on their concrete class and GUID value.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Generates a hash code for this Guid-based enum object.  (Overrides Object..::..GetHashCode()()()().) |

# See Also
GuidEnum Class
Autodesk.Revit.DB Namespace