# ComboBoxMember Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBoxMember Members
ComboBoxMember Class Methods Properties See Also
---
The ComboBoxMember type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GroupName | The group to which the ComboBoxMember is assigned. |
| Image | The image shown on the ComboBoxMember. |

# See Also
ComboBoxMember Class
Autodesk.Revit.UI Namespace