# CentralModelAlreadyExistsException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CentralModelAlreadyExistsException Methods
CentralModelAlreadyExistsException Class See Also
---
The CentralModelAlreadyExistsException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides CentralModelException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
CentralModelAlreadyExistsException Class
Autodesk.Revit.Exceptions Namespace