# InsulationTypeSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InsulationTypeSet Properties
InsulationTypeSet Class See Also
---
The InsulationTypeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of insulation types that are in the set. |

# See Also
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace