# InsulationLiningBase Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InsulationLiningBase Methods
InsulationLiningBase Class See Also
---
The InsulationLiningBase type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetInsulationIds | Returns the ids of the insulation elements associated to a given element. |
| GetLiningIds | Returns the ids of the lining elements associated to a given element. |
| IsValidThickness | Identifies if the given thickness value is valid for assignment to insulation or lining elements. |

# See Also
InsulationLiningBase Class
Autodesk.Revit.DB Namespace