# StructuralSectionGeneralR Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralR Members
StructuralSectionGeneralR Class Constructors Methods Properties See Also
---
The StructuralSectionGeneralR type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionGeneralR | Creates a new instance of Structural Section Pipe. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| WallDesignThickness | Represents wall design thickness of rectangle. |
| WallNominalThickness | Represents wall nominal thickness of rectangle. |

# See Also
StructuralSectionGeneralR Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace