# WorksharedOperationProgressChangedEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksharedOperationProgressChangedEventArgs Properties
WorksharedOperationProgressChangedEventArgs Class See Also
---
The WorksharedOperationProgressChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Location | Full path of the central model which is to be operated. |
| Status | Gets API event status, reflect current operation execution status. |

# See Also
WorksharedOperationProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace