# KeynoteTable Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeynoteTable Members
KeynoteTable Class Methods Properties See Also
---
The KeynoteTable type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetKeynoteTable | Gets the KeynoteTable from a Revit document. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
KeynoteTable Class
Autodesk.Revit.DB Namespace