# EdgeArrayArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EdgeArrayArray Properties
EdgeArrayArray Class See Also
---
The EdgeArrayArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets an edge array at a specified index within the array. |
| Size | Returns the number of edge arrays that are in the array. |

# See Also
EdgeArrayArray Class
Autodesk.Revit.DB Namespace