# AssetPropertyDoubleArray2d Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyDoubleArray2d Properties
AssetPropertyDoubleArray2d Class See Also
---
The AssetPropertyDoubleArray2d type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | Get the value of the property |

# See Also
AssetPropertyDoubleArray2d Class
Autodesk.Revit.DB.Visual Namespace