# CableTraySizeIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CableTraySizeIterator Methods
CableTraySizeIterator Class See Also
---
The CableTraySizeIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | Returns the current MEPSize. |
| HasCurrent | Identifies if the iterator has a current item. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
CableTraySizeIterator Class
Autodesk.Revit.DB.Electrical Namespace