# GenericZoneDomainData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GenericZoneDomainData Members
GenericZoneDomainData Class Methods Properties See Also
---
The GenericZoneDomainData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the GenericZoneDomainData |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
GenericZoneDomainData Class
Autodesk.Revit.DB.Analysis Namespace