# RoutingPreferenceRule Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoutingPreferenceRule Methods
RoutingPreferenceRule Class See Also
---
The RoutingPreferenceRule type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddCriterion | Adds a new routing criterion. |
| Dispose |
| GetCriterion | Gets the specified criteria. |
| RemoveCriteron | Removes an existing criterion. |

# See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace