# StructuralSectionRoundBar Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionRoundBar Members
StructuralSectionRoundBar Class Constructors Methods Properties See Also
---
The StructuralSectionRoundBar type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionRoundBar | Creates a new instance of Structural Section Round Bar shape with the associated set of parameters, used to attach to structural element. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
StructuralSectionRoundBar Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace