# FilterCategoryRule Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterCategoryRule Methods
FilterCategoryRule Class See Also
---
The FilterCategoryRule type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllCategoriesFilterable | Checks that all of the given categories are filterable. |
| GetCategories | Gets the rule's categories. |
| SetCategories | Sets the rule's categories. |

# See Also
FilterCategoryRule Class
Autodesk.Revit.DB Namespace