# RevitCommandId Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitCommandId Methods
RevitCommandId Class See Also
---
The RevitCommandId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| LookupCommandId | Looks up and retrieves the Revit command id with the given id string. |
| LookupPostableCommandId | Looks up and retrieves the Revit command id with the given id string. |

# See Also
RevitCommandId Class
Autodesk.Revit.UI Namespace