# VertexStreamPosition Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexStreamPosition Members
VertexStreamPosition Class Methods Properties See Also
---
The VertexStreamPosition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddVertex | Inserts a VertexStreamPosition into the stream and associated buffer. |
| AddVertices | Inserts multiple VertexStreamPosition instances into the stream and associated buffer. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
VertexStreamPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace