# Gutter Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Gutter Properties
Gutter Class See Also
---
The Gutter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GutterType | Retrieves/set an object that represents the type of the Gutter. |

# See Also
Gutter Class
Autodesk.Revit.DB.Architecture Namespace