# ParameterSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterSet Properties
ParameterSet Class See Also
---
The ParameterSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of parameters that are in the set. |

# See Also
ParameterSet Class
Autodesk.Revit.DB Namespace