# APIObject Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
APIObject Members
APIObject Class Methods Properties See Also
---
The APIObject type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Causes the object to release immediately any resources it may be utilizing. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsReadOnly | Identifies if the object is read-only or modifiable. |

# See Also
APIObject Class
Autodesk.Revit.DB Namespace