# DialogBoxData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DialogBoxData Members
DialogBoxData Class Methods Properties See Also
---
The DialogBoxData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OverrideResult | Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HelpId | An ID that represents the dialog that has been displayed. |

# See Also
DialogBoxData Class
Autodesk.Revit.UI.Events Namespace