# AssetPropertyFloat Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyFloat Methods
AssetPropertyFloat Class See Also
---
The AssetPropertyFloat type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidValue | Checks that the value is a valid value for this property. |

# See Also
AssetPropertyFloat Class
Autodesk.Revit.DB.Visual Namespace