# FilterIntegerRule Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterIntegerRule Members
FilterIntegerRule Class Constructors Methods Properties See Also
---
The FilterIntegerRule type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterIntegerRule | Constructs an instance of FilterIntegerRule. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RuleValue | The user-supplied value against which values from a Revit document will be tested. |

# See Also
FilterIntegerRule Class
Autodesk.Revit.DB Namespace