# Solid Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Solid Methods
Solid Class See Also
---
The Solid type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ComputeCentroid | Returns the Centroid of this solid. |
| GetBoundingBox | Retrieves a box that circumscribes the solid geometry. |
| IntersectWithCurve | Calculates and returns the intersection between a curve and this solid. |

# See Also
Solid Class
Autodesk.Revit.DB Namespace