# DimensionType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DimensionType Properties
DimensionType Class See Also
---
The DimensionType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AlternateUnits | The alternate units display mode for this DimensionType. |
| AlternateUnitsPrefix | The prefix text for the alternate units value. |
| AlternateUnitsSuffix | The suffix text for the alternate units value. |
| Prefix | The prefix text for the dimension value. |
| StyleType | The dimension style type of this DimensionType. |
| Suffix | The suffix text for the dimension value. |

# See Also
DimensionType Class
Autodesk.Revit.DB Namespace