# PanelTypeSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PanelTypeSet Properties
PanelTypeSet Class See Also
---
The PanelTypeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of panel types that are in the set. |

# See Also
PanelTypeSet Class
Autodesk.Revit.DB Namespace