# AssemblyDifference Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyDifference Methods
AssemblyDifference Class See Also
---
The AssemblyDifference type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
AssemblyDifference Class
Autodesk.Revit.DB Namespace