# DWGImportOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DWGImportOptions Methods
DWGImportOptions Class See Also
---
The DWGImportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetLineWeights | Gets array of line weights. |
| SetLineWeights | Set array of line weights. |

# See Also
DWGImportOptions Class
Autodesk.Revit.DB Namespace