# CableTrayType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CableTrayType Properties
CableTrayType Class See Also
---
The CableTrayType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BendMultiplier | Bend multiplier. |
| IsWithFitting | Whether this cable tray type is with fitting |
| ShapeType | Shape of this cable tray type. |

# See Also
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace