# AnalyticalMember Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalMember Methods
AnalyticalMember Class See Also
---
The AnalyticalMember type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of an Analytical Member within the project. |
| FlipCurve | Flip the Analytical Member |
| GetMemberForces | Gets the member forces associated with this Analytical Member. |
| GetReleaseConditions | Gets the release conditions associated with this Analytical Member. |
| GetReleaseType | Gets the release type. |
| IsValidCurve | Verifies if the curve is valid for an Analytical Member. |
| IsValidSectionTypeId | Checks whether the family symbol id is allowed for Analytical Member as Section Type property. |
| SetCurve | Sets the curve for the Analytical Member. |
| SetMemberForces(MemberForces) | Sets Member Forces to Analytical Member. |
| SetMemberForces(Boolean, XYZ, XYZ) | Sets Member Forces to Analytical Member. |
| SetReleaseConditions | Sets Release Conditions to Analytical Member. |
| SetReleaseType | Sets the release type. |

# See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace