# PlanCircuitSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanCircuitSetIterator Properties
PlanCircuitSetIterator Class See Also
---
The PlanCircuitSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
PlanCircuitSetIterator Class
Autodesk.Revit.DB Namespace