# IFCFileWriteOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCFileWriteOptions Methods
IFCFileWriteOptions Class See Also
---
The IFCFileWriteOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace