# BuildingPadType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuildingPadType Methods
BuildingPadType Class See Also
---
The BuildingPadType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateDefault | Creates a BuildingPadType element and adds it to the document. |

# See Also
BuildingPadType Class
Autodesk.Revit.DB Namespace