# FormArray Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FormArray Methods
FormArray Class See Also
---
The FormArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Append |
| Clear | Removes every form from the array, rendering it empty. |
| ForwardIterator | Retrieve a forward moving iterator to the array. |
| GetEnumerator | Retrieve a forward moving iterator to the array. |
| Insert |
| ReverseIterator | Retrieve a backward moving iterator to the array. |

# See Also
FormArray Class
Autodesk.Revit.DB Namespace