# PanelScheduleTemplate Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PanelScheduleTemplate Properties
PanelScheduleTemplate Class See Also
---
The PanelScheduleTemplate type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsBranchPanelSchedule | Checks to see if this object is branch panel schedule template element. |
| IsDataPanelSchedule | Checks to see if this object is data panel schedule template element. |
| IsDefault | Checks to see if this is default template for the given panel schedule type. |
| IsSwitchboardSchedule | Checks to see if this object is switchboard schedule template element. |

# See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace