# PaperSizeSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PaperSizeSet Properties
PaperSizeSet Class See Also
---
The PaperSizeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of objects that are in the set. |

# See Also
PaperSizeSet Class
Autodesk.Revit.DB Namespace