# ReinforcementData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReinforcementData Methods
ReinforcementData Class See Also
---
The ReinforcementData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ReinforcementData Class
Autodesk.Revit.DB.Structure Namespace