# EnergyAnalysisSurface Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EnergyAnalysisSurface Methods
EnergyAnalysisSurface Class See Also
---
The EnergyAnalysisSurface type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAdjacentAnalyticalSpace | Gets the secondary adjacent analytical space this surface is associated with. |
| GetAnalyticalOpenings | Returns the analytical openings of the analytical surface. |
| GetAnalyticalSpace | Gets the primary analytical space this surface is associated with. |
| GetConstruction | Gets the analytic construction this surface is associated with. |
| GetPolyloop | Gets the planar polygon describing the surface geometry. |
| GetPolyloops | Gets the collection of planar polygons describing the surface geometry. |

# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace