# PipeScheduleType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipeScheduleType Methods
PipeScheduleType Class See Also
---
The PipeScheduleType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new pipe schedule type with the given name. |
| GetPipeScheduleId | Returns an existing pipe schedule type with the same name. |

# See Also
PipeScheduleType Class
Autodesk.Revit.DB.Plumbing Namespace