# ElementCategoryFilter Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementCategoryFilter Properties
ElementCategoryFilter Class See Also
---
The ElementCategoryFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CategoryId | The category id. |

# See Also
ElementCategoryFilter Class
Autodesk.Revit.DB Namespace