# Construction Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Construction Members
Construction Class Methods Properties See Also
---
The Construction type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Id | Get the id of the Construction. |
| Name | Get the name of the Construction. |

# See Also
Construction Class
Autodesk.Revit.DB Namespace