# ConduitSizes Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConduitSizes Methods
ConduitSizes Class See Also
---
The ConduitSizes type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Contains | Checks whether a conduit size with the nominal diameter exists. |
| Dispose |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetConduitSizesIterator | Returns a ConduitSizeIterator to the conduit sizes. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |

# See Also
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace