# MEPAnalyticalSystem Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalSystem Methods
MEPAnalyticalSystem Class See Also
---
The MEPAnalyticalSystem type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new analytical system |
| GetAirSystemData | Returns the air system data, null if not available. |
| GetWaterLoopData | Returns the water loop data, null if not available. |

# See Also
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace