# PhotometricWebLightDistribution Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PhotometricWebLightDistribution Properties
PhotometricWebLightDistribution Class See Also
---
The PhotometricWebLightDistribution type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PhotometricWebFile | The filename of an IES photometric web file. |
| TiltAngle | The tilt angle. |

# See Also
PhotometricWebLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace