# ConicalSurface Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConicalSurface Properties
ConicalSurface Class See Also
---
The ConicalSurface type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Axis | Axis of the cone. This is the Z axis of the local coordinate system associated with this cone. |
| HalfAngle | Cone angle. |
| Origin | Apex of the cone. This is the origin of the local coordinate system associated with this cone. |
| XDir | X axis of the local coordinate system associated with this cone. |
| YDir | X axis of the local coordinate system associated with this cone. |

# See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace