# FileNotFoundException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileNotFoundException Methods
FileNotFoundException Class See Also
---
The FileNotFoundException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides IOException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
FileNotFoundException Class
Autodesk.Revit.Exceptions Namespace