# Profile Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Profile Properties
Profile Class See Also
---
The Profile type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Curves | Retrieve the curves that make up the boundary of the profile. |
| Filled | Get or set whether the profile is filled. |
| Transformed | Transforms this profile and returns the result. |

# See Also
Profile Class
Autodesk.Revit.DB Namespace