# RevitLinkType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitLinkType Properties
RevitLinkType Class See Also
---
The RevitLinkType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AttachmentType | The attachment/overlay status of this link. |
| IsNestedLink | Indicates whether this link is a nested or top-level link. |
| LocallyUnloaded | Checks whether a Revit link in a local model is unloaded only for the current user. |
| PathType | The type of path the link uses. |

# See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace