# RoofBase Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoofBase Properties
RoofBase Class See Also
---
The RoofBase type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EaveCuts | Retrieve or set the EaveCutterType. |
| FasciaDepth | Retrieve or set the FasciaDepth. |
| RoofType | Retrieve or set the Type. |
| SlabShapeEditor | **Obsolete.** Get the SlabShapeEditor used for slab shape editing. |

# See Also
RoofBase Class
Autodesk.Revit.DB Namespace