# StructuralSectionColdFormed Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionColdFormed Properties
StructuralSectionColdFormed Class See Also
---
The StructuralSectionColdFormed type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InnerFillet | Inner Fillet - Corner fillet inner radius. |
| WallDesignThickness | Represents wall design thickness of rectangle. |
| WallNominalThickness | Represents wall nominal thickness of rectangle. |

# See Also
StructuralSectionColdFormed Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace