# RevisionSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevisionSettings Properties
RevisionSettings Class See Also
---
The RevisionSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RevisionCloudSpacing | Determines the size in paper space of revision clouds drawn in a project. |
| RevisionNumbering | Determines how the revision number values will display on sheets. |

# See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace