# ParameterMapIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterMapIterator Methods
ParameterMapIterator Class See Also
---
The ParameterMapIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the map. |

# See Also
ParameterMapIterator Class
Autodesk.Revit.DB Namespace