# ComponentRepeaterSlot Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComponentRepeaterSlot Properties
ComponentRepeaterSlot Class See Also
---
The ComponentRepeaterSlot type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilyType | The id of the family type of the component in the slot, or invalid id if the slot is empty. |
| IsDefault | A flag indicating whether the slot currently holds an instance of the default family type of the component repeater. |
| IsEmpty | A flag indicating whether the slot is currently empty. |

# See Also
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace