# StructuralConnectionApprovalType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralConnectionApprovalType Methods
StructuralConnectionApprovalType Class See Also
---
The StructuralConnectionApprovalType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new StructuralConnectionApprovalType. |
| GetAllStructuralConnectionApprovalTypes | Collects the ids of all StructuralConnectionApprovalTypes in the document. |
| IsValidApprovalTypeName | Verifies if the provided approval name is unique in the document. |

# See Also
StructuralConnectionApprovalType Class
Autodesk.Revit.DB.Structure Namespace