# WireMaterialTypeSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireMaterialTypeSet Properties
WireMaterialTypeSet Class See Also
---
The WireMaterialTypeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of wire material types that are in the set. |

# See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace