# IndexTriangle Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexTriangle Properties
IndexTriangle Class See Also
---
The IndexTriangle type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Index0 | The index of the triangle's first vertex. |
| Index1 | The index of the triangle's second vertex. |
| Index2 | The index of the triangle's third vertex. |

# See Also
IndexTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace