# TextNote Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextNote Properties
TextNote Class See Also
---
The TextNote type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LeaderCount | Number of leader objects currently attached to the text note. |
| LeaderLeftAttachment | Attachment position of leaders on the left side of the text note. |
| LeaderRightAttachment | Attachment position of leaders on the right side of the text note. |
| TextNoteType | Access the type of the TextNote object. |

# See Also
TextNote Class
Autodesk.Revit.DB Namespace