# ReinforcementAbbreviationTag Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReinforcementAbbreviationTag Methods
ReinforcementAbbreviationTag Class See Also
---
The ReinforcementAbbreviationTag type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ReinforcementAbbreviationTag Class
Autodesk.Revit.DB.Structure Namespace