# SpotDimension Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpotDimension Methods
SpotDimension Class See Also
---
The SpotDimension type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanFlip | Verifies that the direction of the dimension can be flipped. |
| Flip | Flips dimension to the other side of the host. |

# See Also
SpotDimension Class
Autodesk.Revit.DB Namespace