# AppearanceAssetEditScope Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AppearanceAssetEditScope Methods
AppearanceAssetEditScope Class See Also
---
The AppearanceAssetEditScope type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancel | Cancels the edit scope. |
| Commit | Finishes the edit scope. |
| Dispose |
| Start | Starts the edit scope. |

# See Also
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace