# CorrectionFactorSetIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CorrectionFactorSetIterator Methods
CorrectionFactorSetIterator Class See Also
---
The CorrectionFactorSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
CorrectionFactorSetIterator Class
Autodesk.Revit.DB.Electrical Namespace