# CurtainGridSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurtainGridSet Properties
CurtainGridSet Class See Also
---
The CurtainGridSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of objects that are in the set. |

# See Also
CurtainGridSet Class
Autodesk.Revit.DB Namespace