# GradientBackgroundSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GradientBackgroundSettings Properties
GradientBackgroundSettings Class See Also
---
The GradientBackgroundSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GroundColor | The color of the ground. |
| HorizonColor | The color of the horizon. |
| SkyColor | The color of the top of the sky. |

# See Also
GradientBackgroundSettings Class
Autodesk.Revit.DB Namespace