# ViewExportedEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewExportedEventArgs Properties
ViewExportedEventArgs Class See Also
---
The ViewExportedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ViewId | Identifies the view that was exported. |

# See Also
ViewExportedEventArgs Class
Autodesk.Revit.DB.Events Namespace