# FilterNumericValueRule Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterNumericValueRule Methods
FilterNumericValueRule Class See Also
---
The FilterNumericValueRule type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetEvaluator | Gets the evaluator that implements the test for this rule. |
| SetEvaluator | Sets the evaluator that implements the test for this rule. |

# See Also
FilterNumericValueRule Class
Autodesk.Revit.DB Namespace