# ViewDrafting Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewDrafting Members
ViewDrafting Class Methods Properties See Also
---
The ViewDrafting type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new ViewDrafting in the model. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ViewDrafting Class
Autodesk.Revit.DB Namespace