# WorksetConfiguration Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksetConfiguration Methods
WorksetConfiguration Class See Also
---
The WorksetConfiguration type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Close | Sets a group of user-created worksets to close. |
| Dispose |
| Open | Sets a group of user-created worksets to open. |

# See Also
WorksetConfiguration Class
Autodesk.Revit.DB Namespace