# PreDocEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PreDocEventArgs Members
PreDocEventArgs Class Methods Properties See Also
---
The PreDocEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | The document associated with the event. |

# See Also
PreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace