# SpatialElementDomainData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementDomainData Methods
SpatialElementDomainData Class See Also
---
The SpatialElementDomainData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
SpatialElementDomainData Class
Autodesk.Revit.DB Namespace