# FluidTemperature Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FluidTemperature Methods
FluidTemperature Class See Also
---
The FluidTemperature type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace