# FileOpenDialog Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileOpenDialog Members
FileOpenDialog Class Constructors Methods Properties See Also
---
The FileOpenDialog type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FileOpenDialog | Constructs a new instance of a File Open dialog. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ShowPreview | Identifies if the dialog should include a region showing a preview of the selected file. |

# See Also
FileOpenDialog Class
Autodesk.Revit.UI Namespace