# ArgumentsInconsistentException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ArgumentsInconsistentException Methods
ArgumentsInconsistentException Class See Also
---
The ArgumentsInconsistentException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ArgumentException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
ArgumentsInconsistentException Class
Autodesk.Revit.Exceptions Namespace