# SymbolicCurve Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SymbolicCurve Properties
SymbolicCurve Class See Also
---
The SymbolicCurve type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsDrawnInForeground | Indicates if this curve will be drawn in the foreground of the family instance. |
| ReferenceType | Indicates the type of reference. |
| Subcategory | The subcategory. |

# See Also
SymbolicCurve Class
Autodesk.Revit.DB Namespace