# KeynoteEntries Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeynoteEntries Methods
KeynoteEntries Class See Also
---
The KeynoteEntries type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LoadKeynoteEntriesFromFile | Loads the contents of a keynote text file into the provided KeyBasedTreeEntriesLoadContent. |

# See Also
KeynoteEntries Class
Autodesk.Revit.DB Namespace