# CurveArrArrayIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveArrArrayIterator Properties
CurveArrArrayIterator Class See Also
---
The CurveArrArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
CurveArrArrayIterator Class
Autodesk.Revit.DB Namespace