# SpatialElementBoundaryOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementBoundaryOptions Methods
SpatialElementBoundaryOptions Class See Also
---
The SpatialElementBoundaryOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
SpatialElementBoundaryOptions Class
Autodesk.Revit.DB Namespace