# StdPostedWarning Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StdPostedWarning Members
StdPostedWarning Class Methods Properties See Also
---
The StdPostedWarning type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the StdPostedWarning |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
StdPostedWarning Class
Autodesk.Revit.DB Namespace