# FilterStringRule Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringRule Methods
FilterStringRule Class See Also
---
The FilterStringRule type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetEvaluator | Gets the evaluator that implements the test for this rule. |
| SetEvaluator | Sets the evaluator that implements the test for this rule. |

# See Also
FilterStringRule Class
Autodesk.Revit.DB Namespace