# AnalyticalOpening Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalOpening Methods
AnalyticalOpening Class See Also
---
The AnalyticalOpening type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of an Analytical Opening within the project. |
| IsCurveLoopValidForAnalyticalOpening | Checks if curve loop is valid for Analytical Opening. |

# See Also
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace