# SketchPlane Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SketchPlane Methods
SketchPlane Class See Also
---
The SketchPlane type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, ElementId) | Creates a sketch plane from a grid, reference plane, or level. |
| Create(Document, Plane) | Creates a new sketch plane from a geometric plane. |
| Create(Document, Reference) | Creates a new sketch plane from a reference to a planar face. |
| GetPlane | Returns the corresponding Plane. |
| GetPlaneReference | Returns a reference to this element as a plane. |

# See Also
SketchPlane Class
Autodesk.Revit.DB Namespace