# PointCloudInstance Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudInstance Properties
PointCloudInstance Class See Also
---
The PointCloudInstance type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterAction | The action taken based on the results of the selection filter applied to this point cloud. |
| SupportsOverrides | Identifies whether the instance can have graphic overrides. |

# See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace