# BalusterInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BalusterInfo Methods
BalusterInfo Class See Also
---
The BalusterInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetReferenceNameForHost | Gets the name string to be used as a reference to Host in the current language. |
| GetReferenceNameForTopRail | Gets the name string to be used as a reference to Top Rail in the current language. |

# See Also
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace