# FileExportingEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileExportingEventArgs Properties
FileExportingEventArgs Class See Also
---
The FileExportingEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Format | Identifies the export format, e.g. DWG or image. |
| Path | The target path for the export. |

# See Also
FileExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace