# IndexStreamPoint Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexStreamPoint Methods
IndexStreamPoint Class See Also
---
The IndexStreamPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddPoint | Inserts a IndexPoint into the stream and associated buffer. |
| AddPoints | Inserts multiple IndexPoint instances into the stream and associated buffer. |

# See Also
IndexStreamPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace