# AssemblyMemberDifferentCategory Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyMemberDifferentCategory Members
AssemblyMemberDifferentCategory Class Methods Properties See Also
---
The AssemblyMemberDifferentCategory type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CategoryId1 | Category id of the first assembly member |
| CategoryId2 | Category id of the second assembly member |

# See Also
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace