# StringParameterValue Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StringParameterValue Members
StringParameterValue Class Constructors Methods Properties See Also
---
The StringParameterValue type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StringParameterValue()()()() | Default constructor |
| StringParameterValue(String) | Value constructor |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The stored value |

# See Also
StringParameterValue Class
Autodesk.Revit.DB Namespace