# SpatialElement Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElement Properties
SpatialElement Class See Also
---
The SpatialElement type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Area | The area. |
| Level | Gets the level of the room. |
| Location | The location of the element. (Overrides Element..::..Location.) |
| Name | A human readable name for the Element. (Overrides Element..::..Name.) |
| Number | The number. |
| Perimeter | The perimeter. |
| SpatialElementType | The spatial element type. |

# See Also
SpatialElement Class
Autodesk.Revit.DB Namespace