# PaperSize Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PaperSize Members
PaperSize Class Methods Properties See Also
---
The PaperSize type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Name | Retrieve the paper size name of current project. |

# See Also
PaperSize Class
Autodesk.Revit.DB Namespace