# ElementType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementType Properties
ElementType Class See Also
---
The ElementType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanBeCopied | Determine if this ElementType can create a copy |
| CanBeDeleted | Determine if this ElementType can be deleted |
| CanBeRenamed | Determine if this ElementType can be renamed |
| FamilyName | Gets the family name of this element type. |
| Name | Set the name for the ElementType. (Overrides Element..::..Name.) |

# See Also
ElementType Class
Autodesk.Revit.DB Namespace