# WireSizeSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireSizeSet Properties
WireSizeSet Class See Also
---
The WireSizeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of wire sizes that are in the set. |

# See Also
WireSizeSet Class
Autodesk.Revit.DB.Electrical Namespace