# FabricationDimensionDefinition Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationDimensionDefinition Methods
FabricationDimensionDefinition Class See Also
---
The FabricationDimensionDefinition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace