# AppearanceAssetElement Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AppearanceAssetElement Methods
AppearanceAssetElement Class See Also
---
The AppearanceAssetElement type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new AppearanceAssetElement from an existing rendering asset. |
| Duplicate | Duplicates the appearance asset element. |
| GetAppearanceAssetElementByName | Gets an AppearanceAssetElement by name. |
| GetRenderingAsset | Gets the rendering asset for the appearance asset element. |
| SetRenderingAsset | Sets the rendering asset for the appearance asset element. |

# See Also
AppearanceAssetElement Class
Autodesk.Revit.DB Namespace