# ElementTypeDuplicatingEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementTypeDuplicatingEventArgs Members
ElementTypeDuplicatingEventArgs Class Methods Properties See Also
---
The ElementTypeDuplicatingEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementTypeId | The id of the ElementType to be duplicated. |

# See Also
ElementTypeDuplicatingEventArgs Class
Autodesk.Revit.DB.Events Namespace