# FilterStringGreaterOrEqual Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringGreaterOrEqual Members
FilterStringGreaterOrEqual Class Constructors Methods Properties See Also
---
The FilterStringGreaterOrEqual type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringGreaterOrEqual | Constructs an instance of FilterStringGreaterOrEqual. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterStringGreaterOrEqual Class
Autodesk.Revit.DB Namespace