# VertexPositionColored Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexPositionColored Properties
VertexPositionColored Class See Also
---
The VertexPositionColored type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Position | The vertex's position. |

# See Also
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace