# TableCellCalculatedValueData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableCellCalculatedValueData Members
TableCellCalculatedValueData Class Methods Properties See Also
---
The TableCellCalculatedValueData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the TableCellCalculatedValueData |
| GetName | Gets the name of the calculated value. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
TableCellCalculatedValueData Class
Autodesk.Revit.DB Namespace