# ScheduleSortGroupField Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleSortGroupField Methods
ScheduleSortGroupField Class See Also
---
The ScheduleSortGroupField type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace