# ReferenceArrayArrayIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferenceArrayArrayIterator Methods
ReferenceArrayArrayIterator Class See Also
---
The ReferenceArrayArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
ReferenceArrayArrayIterator Class
Autodesk.Revit.DB Namespace