# FluidTemperatureSetIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FluidTemperatureSetIterator Methods
FluidTemperatureSetIterator Class See Also
---
The FluidTemperatureSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | Returns the current FluidTemperature. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
FluidTemperatureSetIterator Class
Autodesk.Revit.DB.Plumbing Namespace