# LoadCombination Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadCombination Properties
LoadCombination Class See Also
---
The LoadCombination type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsThirdPartyGenerated | Indicates if the load combination was created by API. |
| State | The state of the load combination. |
| Type | The type of the load combination. |

# See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace