# FabricationItemFolder Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationItemFolder Methods
FabricationItemFolder Class See Also
---
The FabricationItemFolder type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetItemFiles | Gets the item files in this item folder. |
| GetSubFolders | Gets the item folder's sub folders. |

# See Also
FabricationItemFolder Class
Autodesk.Revit.DB Namespace