# DirectoryNotFoundException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectoryNotFoundException Methods
DirectoryNotFoundException Class See Also
---
The DirectoryNotFoundException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides IOException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
DirectoryNotFoundException Class
Autodesk.Revit.Exceptions Namespace