# MechanicalSystem Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MechanicalSystem Properties
MechanicalSystem Class See Also
---
The MechanicalSystem type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BaseEquipmentConnector | The connector within the base equipment which is used to connect with the system. |
| DuctNetwork | The ducts and fittings contained within the system. |
| IsWellConnected | Indicates if the system is well connected or not. |
| SystemType | The type of this duct system. |

# See Also
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace