# LayerModifier Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LayerModifier Methods
LayerModifier Class See Also
---
The LayerModifier type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
LayerModifier Class
Autodesk.Revit.DB Namespace