# MaterialNode Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MaterialNode Methods
MaterialNode Class See Also
---
The MaterialNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAppearance | Appearance properties associated with the material. |
| GetAppearanceOverride | Returns appearance properties that override the preset appearance of the material. |

# See Also
MaterialNode Class
Autodesk.Revit.DB Namespace