# SpaceTag Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpaceTag Members
SpaceTag Class Methods Properties See Also
---
The SpaceTag type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Space | The space that the tag is associated with. |
| SpaceTagType | The tag type. |

# See Also
SpaceTag Class
Autodesk.Revit.DB.Mechanical Namespace