# CurveArrArrayIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveArrArrayIterator Methods
CurveArrArrayIterator Class See Also
---
The CurveArrArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
CurveArrArrayIterator Class
Autodesk.Revit.DB Namespace