# GroupType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GroupType Methods
GroupType Class See Also
---
The GroupType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAvailableAttachedDetailGroupTypeIds | Returns the attached detail groups available for this element group type. |
| LoadFrom | Replaces the group with the contents of the input file. |

# See Also
GroupType Class
Autodesk.Revit.DB Namespace