# EditScope Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EditScope Methods
EditScope Class See Also
---
The EditScope type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancel | Cancels the edit scope. |
| Commit | Finishes the edit scope. |
| Dispose |

# See Also
EditScope Class
Autodesk.Revit.DB Namespace