# FaceSplitter Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceSplitter Methods
FaceSplitter Class See Also
---
The FaceSplitter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetBoundaries | Gets the boundaries. |

# See Also
FaceSplitter Class
Autodesk.Revit.DB Namespace