# FamilyInstancePlacingArgs Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyInstancePlacingArgs Methods
FamilyInstancePlacingArgs Class See Also
---
The FamilyInstancePlacingArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
FamilyInstancePlacingArgs Class
Autodesk.Revit.UI Namespace