# RoofComponents Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoofComponents Methods
RoofComponents Class See Also
---
The RoofComponents type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetAreasOfCurveLoops | The areas of CurveLoops of roof slabs. |
| GetCurveLoops | The CurveLoops of roof slabs. |
| GetLoopFaces | The faces of the loops of roof slabs. |
| GetPlaneDirections | The plane directions of roof slabs. |
| GetPlaneOrigins | The plane origins of roof slabs. |

# See Also
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace