# PlanCircuitSet Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanCircuitSet Methods
PlanCircuitSet Class See Also
---
The PlanCircuitSet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Removes every item from the set, rendering it empty. |
| Contains | Tests for the existence of an item within the set. |
| Erase | Removes a specified object from the set. |
| ForwardIterator | Retrieve a forward moving iterator to the set. |
| GetEnumerator | Retrieve a forward moving iterator to the set. |
| Insert | Insert the specified item into the set. |
| ReverseIterator | Retrieve a backward moving iterator to the set. |

# See Also
PlanCircuitSet Class
Autodesk.Revit.DB Namespace