# MEPAnalyticalSegment Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalSegment Methods
MEPAnalyticalSegment Class See Also
---
The MEPAnalyticalSegment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace