# CorrectionFactorSet Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CorrectionFactorSet Methods
CorrectionFactorSet Class See Also
---
The CorrectionFactorSet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Removes every correction factor from the set, rendering it empty. |
| Contains |
| Erase |
| ForwardIterator | Retrieve a forward moving iterator to the set. |
| GetEnumerator | Retrieve a forward moving iterator to the set. |
| Insert |
| ReverseIterator | Retrieve a backward moving iterator to the set. |

# See Also
CorrectionFactorSet Class
Autodesk.Revit.DB.Electrical Namespace