# FabricationPartBrowserChangedEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationPartBrowserChangedEventArgs Properties
FabricationPartBrowserChangedEventArgs Class See Also
---
The FabricationPartBrowserChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NumberOfSolutions | The number of active solutions in routing solution mode. |
| Operation | The operation associated with this event |
| ServiceId | The identifier for the fabrication service. |

# See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace