# ExternalDataInstanceAddingIntoDocumentEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalDataInstanceAddingIntoDocumentEventArgs Properties
ExternalDataInstanceAddingIntoDocumentEventArgs Class See Also
---
The ExternalDataInstanceAddingIntoDocumentEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TypeId | The type id of the newl external data instance that is being added. |

# See Also
ExternalDataInstanceAddingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace