# CustomInitialColor Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CustomInitialColor Members
CustomInitialColor Class Constructors Methods Properties See Also
---
The CustomInitialColor type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CustomInitialColor(Double) | Creates a custom initial color set to the given color |
| CustomInitialColor(CustomInitialColor) | Creates a copy of the given custom initial color |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Temperature | The custom color temperature value. |

# See Also
CustomInitialColor Class
Autodesk.Revit.DB.Lighting Namespace