# FamilyThermalProperties Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyThermalProperties Methods
FamilyThermalProperties Class See Also
---
The FamilyThermalProperties type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Find | Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml. |
| IsValid | Confirms that the thermal properties are correctly set for assignment to a FamilySymbol. |

# See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace