# AssetPropertyFloatArray Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyFloatArray Methods
AssetPropertyFloatArray Class See Also
---
The AssetPropertyFloatArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetValue | Get the value of the property. |

# See Also
AssetPropertyFloatArray Class
Autodesk.Revit.DB.Visual Namespace