# IndexStream Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexStream Methods
IndexStream Class See Also
---
The IndexStream type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
IndexStream Class
Autodesk.Revit.DB.DirectContext3D Namespace