# ExternalDefinition Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalDefinition Methods
ExternalDefinition Class See Also
---
The ExternalDefinition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetGroupTypeId | Returns the identifier of the parameter definition's parameter group.  (Overrides Definition..::..GetGroupTypeId()()()().) |

# See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace