# Floor Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Floor Properties
Floor Class See Also
---
The Floor type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FloorType | Retrieves/sets an object that represents the type of the floor. |
| SketchId | Returns id of the sketch. |
| SlabShapeEditor | **Obsolete.** Get the SlabShapeEditor used for slab shape editing. |
| SpanDirectionAngle | Retrieve the span direction angle of the floor. |

# See Also
Floor Class
Autodesk.Revit.DB Namespace