# FilterNumericLessOrEqual Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterNumericLessOrEqual Members
FilterNumericLessOrEqual Class Constructors Methods Properties See Also
---
The FilterNumericLessOrEqual type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterNumericLessOrEqual | Constructs an instance of FilterNumericLessOrEqual. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterNumericLessOrEqual Class
Autodesk.Revit.DB Namespace