# TriangulationInterfaceForTriangulatedSolidOrShell Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TriangulationInterfaceForTriangulatedSolidOrShell Members
TriangulationInterfaceForTriangulatedSolidOrShell Class Constructors Methods Properties See Also
---
The TriangulationInterfaceForTriangulatedSolidOrShell type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TriangulationInterfaceForTriangulatedSolidOrShell | Construct an interface object for a TriangulatedSolidOrShell. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
TriangulationInterfaceForTriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace