# RevitAPIPreDocEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitAPIPreDocEventArgs Properties
RevitAPIPreDocEventArgs Class See Also
---
The RevitAPIPreDocEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | The document associated with the event. |

# See Also
RevitAPIPreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace