# AssemblyDifferenceMemberDifference Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyDifferenceMemberDifference Members
AssemblyDifferenceMemberDifference Class Methods Properties See Also
---
The AssemblyDifferenceMemberDifference type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MemberDifference | Difference between the assembly members |
| MemberId1 | Id of the member in the first assembly |
| MemberId2 | Id of the member in the second assembly |

# See Also
AssemblyDifferenceMemberDifference Class
Autodesk.Revit.DB Namespace