# ViewSheetSetting Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewSheetSetting Properties
ViewSheetSetting Class See Also
---
The ViewSheetSetting type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AvailableViews | All views that can be printed. |
| CurrentViewSheetSet | The current view sheet set of PrintSetup. |
| InSession | The in-session view sheet set of Print Setup. |

# See Also
ViewSheetSetting Class
Autodesk.Revit.DB Namespace