# GenericForm Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GenericForm Methods
GenericForm Class See Also
---
The GenericForm type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetVisibility | Gets the visibility for the generic form. |
| SetVisibility | Sets the visibility for the generic form. |

# See Also
GenericForm Class
Autodesk.Revit.DB Namespace