# GeomCombinationSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GeomCombinationSet Properties
GeomCombinationSet Class See Also
---
The GeomCombinationSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of GeomCombinations that are in the set. |

# See Also
GeomCombinationSet Class
Autodesk.Revit.DB Namespace