# StructuralSectionGeneralC Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralC Properties
StructuralSectionGeneralC Class See Also
---
The StructuralSectionGeneralC type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LipLength | Lip segment length. |

# See Also
StructuralSectionGeneralC Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace