# ElementSetIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementSetIterator Methods
ElementSetIterator Class See Also
---
The ElementSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
ElementSetIterator Class
Autodesk.Revit.DB Namespace