# StructuralSectionGeneralW Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralW Properties
StructuralSectionGeneralW Class See Also
---
The StructuralSectionGeneralW type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FlangeFillet | Flange Fillet - fillet radius at the flange end. |
| TopWebFillet | Top Web Fillet - fillet radius at the top of web. |

# See Also
StructuralSectionGeneralW Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace