# FileDialog Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileDialog Methods
FileDialog Class See Also
---
The FileDialog type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetSelectedModelPath | Returns the selected file path chosen by the user. |
| IsValidFilterString | Determines if the input string is acceptable as input for a FileDialog filter string. |
| Show | Shows the dialog using the stored settings. |

# See Also
FileDialog Class
Autodesk.Revit.UI Namespace