# RibbonItemEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RibbonItemEventArgs Members
RibbonItemEventArgs Class Constructors Methods Properties See Also
---
The RibbonItemEventArgs type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RibbonItemEventArgs | Initializes a new instance of the RibbonItemEventArgs class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Application | The current UIApplication. |

# See Also
RibbonItemEventArgs Class
Autodesk.Revit.UI.Events Namespace