# IndexPrimitive Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexPrimitive Methods
IndexPrimitive Class See Also
---
The IndexPrimitive type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
IndexPrimitive Class
Autodesk.Revit.DB.DirectContext3D Namespace