# PlanTopologySet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanTopologySet Properties
PlanTopologySet Class See Also
---
The PlanTopologySet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of objects that are in the set. |

# See Also
PlanTopologySet Class
Autodesk.Revit.DB Namespace