# ViewsExportingByContextEventArgs Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewsExportingByContextEventArgs Methods
ViewsExportingByContextEventArgs Class See Also
---
The ViewsExportingByContextEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetViewIds | Gets the views about to be exported by CustomExporter. |

# See Also
ViewsExportingByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace