# NavisworksExportOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NavisworksExportOptions Methods
NavisworksExportOptions Class See Also
---
The NavisworksExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetSelectedElementIds | Returns the element ids of the elements to export. Empty by default. |
| SetSelectedElementIds | Sets the element ids of the elements to export. Used only when ExportScope = SelectedElements. |

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace