# FaceNode Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceNode Members
FaceNode Class Methods Properties See Also
---
The FaceNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetFace | Returns the Face object corresponding to the node. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FaceNode Class
Autodesk.Revit.DB Namespace