# DisplayingOptionsDialogEventArgs Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DisplayingOptionsDialogEventArgs Methods
DisplayingOptionsDialogEventArgs Class See Also
---
The DisplayingOptionsDialogEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddTab | Add tab to option dialog with tab name and handler information. |

# See Also
DisplayingOptionsDialogEventArgs Class
Autodesk.Revit.UI.Events Namespace