# StructuralSectionLProfileWithLips Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionLProfileWithLips Members
StructuralSectionLProfileWithLips Class Constructors Methods Properties See Also
---
The StructuralSectionLProfileWithLips type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionLProfileWithLips | Creates a new instance of Structural Section L Profile With Lips shape with the associated set of parameters, used to attach to structural element. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
StructuralSectionLProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace