# StructuralSectionsServiceData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionsServiceData Methods
StructuralSectionsServiceData Class See Also
---
The StructuralSectionsServiceData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrentElements | Returns the list of Ids of the current elements. |

# See Also
StructuralSectionsServiceData Class
Autodesk.Revit.DB.Structure Namespace