# SKPImportOptions Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SKPImportOptions Members
SKPImportOptions Class Constructors Methods Properties See Also
---
The SKPImportOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SKPImportOptions()()()() | Constructs a new instance of SKPImportOptions with default values of all properties. |
| SKPImportOptions(SKPImportOptions) | Constructs a new instance of SKPImportOptions as a copy of the import options. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
SKPImportOptions Class
Autodesk.Revit.DB Namespace