# FilterStringGreater Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringGreater Members
FilterStringGreater Class Constructors Methods Properties See Also
---
The FilterStringGreater type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringGreater | Constructs an instance of FilterStringGreater. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterStringGreater Class
Autodesk.Revit.DB Namespace