# DocumentSavedAsEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentSavedAsEventArgs Properties
DocumentSavedAsEventArgs Class See Also
---
The DocumentSavedAsEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsSavingAsCentralFile | Indicates whether the document is to be saved as central file. |
| OriginalPath | Original path of the document. |

# See Also
DocumentSavedAsEventArgs Class
Autodesk.Revit.DB.Events Namespace