# CreateRelatedFileProgressChangedEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CreateRelatedFileProgressChangedEventArgs Properties
CreateRelatedFileProgressChangedEventArgs Class See Also
---
The CreateRelatedFileProgressChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreatingCloudSharedLocal | Indicates if it is creating cloud shared local model. |
| DownloadFinished | Indicates if all data downloads are finished. |
| FullDownload | Indicates if download the full data of the document, which will take longer than subsequent downloads. |

# See Also
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace