# IPipePlumbingFixtureFlowServer Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IPipePlumbingFixtureFlowServer Methods
IPipePlumbingFixtureFlowServer Interface See Also
---
The IPipePlumbingFixtureFlowServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Calculate | Calculate the pipe plumbing fixture flow. |
| GetHtmlDescription | The method that Revit will invoke to get an HTML formatted description of the server. |
| GetInformationLink | The method that Revit will invoke to obtain a URL address which provides more information about the server. |

# See Also
IPipePlumbingFixtureFlowServer Interface
Autodesk.Revit.DB.Plumbing Namespace