# Arc Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Arc Properties
Arc Class See Also
---
The Arc type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Center | Returns the center of the arc. |
| Normal | Returns the normal to the plane in which the arc is defined. |
| Radius | Returns the radius of the arc. |
| XDirection | Returns the X direction. |
| YDirection | Returns the Y direction. |

# See Also
Arc Class
Autodesk.Revit.DB Namespace