# Profile Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Profile Methods
Profile Class See Also
---
The Profile type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Returns a copy of this profile. |

# See Also
Profile Class
Autodesk.Revit.DB Namespace