# AssetPropertyDouble Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyDouble Properties
AssetPropertyDouble Class See Also
---
The AssetPropertyDouble type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The value of the property. |

# See Also
AssetPropertyDouble Class
Autodesk.Revit.DB.Visual Namespace