# ScheduleFieldId Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleFieldId Methods
ScheduleFieldId Class See Also
---
The ScheduleFieldId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Gets the integer value of the id as hash code  (Overrides Object..::..GetHashCode()()()().) |
| ToString | Gets a String representation of the integer value of the id.  (Overrides Object..::..ToString()()()().) |

# See Also
ScheduleFieldId Class
Autodesk.Revit.DB Namespace