# ExternallyTaggedNonBRep Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedNonBRep Members
ExternallyTaggedNonBRep Class Constructors Methods Properties See Also
---
The ExternallyTaggedNonBRep type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternallyTaggedNonBRep | Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetUsage | Controls the usage of this ExternallyTaggedNonBRep. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ExternallyTaggedNonBRep Class
Autodesk.Revit.DB Namespace