# Solid Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Solid Properties
Solid Class See Also
---
The Solid type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Edges | The edges that belong to the solid. |
| Faces | The faces that belong to the solid. |
| SurfaceArea | Returns the total surface area of this solid. |
| Volume | Returns the signed volume of this solid. |

# See Also
Solid Class
Autodesk.Revit.DB Namespace