# DefaultOpenFromCloudCallback Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefaultOpenFromCloudCallback Methods
DefaultOpenFromCloudCallback Class See Also
---
The DefaultOpenFromCloudCallback type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| OnOpenConflict | A method called when the conflict is happen during the model opening. |

# See Also
DefaultOpenFromCloudCallback Class
Autodesk.Revit.DB Namespace