# BalusterPattern Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BalusterPattern Methods
BalusterPattern Class See Also
---
The BalusterPattern type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| DuplicateBaluster | Duplicates the baluster pointed by given index in the main baluster pattern. |
| GetBaluster | Gets information about the given baluster from the main baluster pattern. |
| GetBalusterCount | Gets the number of balusters in the main baluster pattern definition. |
| RemoveBaluster | Removes a baluster from the main baluster pattern. |

# See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace