# IFCExtrusionCalculatorOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCExtrusionCalculatorOptions Methods
IFCExtrusionCalculatorOptions Class See Also
---
The IFCExtrusionCalculatorOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace