# ComponentRepeaterIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComponentRepeaterIterator Methods
ComponentRepeaterIterator Class See Also
---
The ComponentRepeaterIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | Returns the current repeater slot. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
ComponentRepeaterIterator Class
Autodesk.Revit.DB Namespace