# GroundConductorSizeSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GroundConductorSizeSet Properties
GroundConductorSizeSet Class See Also
---
The GroundConductorSizeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of GroundConductorSizes that are in the set. |

# See Also
GroundConductorSizeSet Class
Autodesk.Revit.DB.Electrical Namespace