# SelectableInViewFilter Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SelectableInViewFilter Members
SelectableInViewFilter Class Constructors Methods Properties See Also
---
The SelectableInViewFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SelectableInViewFilter(Document, ElementId) | Constructs a new instance of an SelectableInViewFilter. |
| SelectableInViewFilter(Document, ElementId, Boolean) | Constructs a new instance of an SelectableInViewFilter, with the option to pass all non-selectable elements. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
SelectableInViewFilter Class
Autodesk.Revit.UI.Selection Namespace