# DuctSizeSettingIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctSizeSettingIterator Methods
DuctSizeSettingIterator Class See Also
---
The DuctSizeSettingIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| HasCurrent | Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the enumerator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
DuctSizeSettingIterator Class
Autodesk.Revit.DB.Mechanical Namespace