# TriangulationInterface Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TriangulationInterface Methods
TriangulationInterface Class See Also
---
The TriangulationInterface type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
TriangulationInterface Class
Autodesk.Revit.DB Namespace