# RegenerationAttribute Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RegenerationAttribute Members
RegenerationAttribute Class Constructors Methods Properties See Also
---
The RegenerationAttribute type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RegenerationAttribute | Constructs a new RegenerationAttribute. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Option | Regeneration option. |

# See Also
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace