# ConduitType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConduitType Members
ConduitType Class Methods Properties See Also
---
The ConduitType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsWithFitting | Whether this conduit type is with fitting |

# See Also
ConduitType Class
Autodesk.Revit.DB.Electrical Namespace