# ReferencePlane Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferencePlane Methods
ReferencePlane Class See Also
---
The ReferencePlane type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Flip | Flips the orientation of the reference plane. |
| GetPlane | Returns the geometry plane to which the reference plane is assigned. |
| GetReference | Returns the geometry reference of the reference plane. |

# See Also
ReferencePlane Class
Autodesk.Revit.DB Namespace