# DialogBoxShowingEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DialogBoxShowingEventArgs Properties
DialogBoxShowingEventArgs Class See Also
---
The DialogBoxShowingEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DialogId | A unique string identifier for DialogBox and TaskDialog type dialogs in Revit. |

# See Also
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace