# BIMExportOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BIMExportOptions Methods
BIMExportOptions Class See Also
---
The BIMExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
BIMExportOptions Class
Autodesk.Revit.DB Namespace