# ModelCurveNode Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModelCurveNode Members
ModelCurveNode Class Methods Properties See Also
---
The ModelCurveNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LineProperties | Access to the line (pen) properties of the curve being drawn |

# See Also
ModelCurveNode Class
Autodesk.Revit.DB Namespace