# StairsLandingType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StairsLandingType Members
StairsLandingType Class Methods Properties See Also
---
The StairsLandingType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsMonolithic | True if the stairs landing is monolithic, false otherwise. |
| Thickness | Thickness of the stairs landing. |

# See Also
StairsLandingType Class
Autodesk.Revit.DB.Architecture Namespace