# LoadNature Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadNature Methods
LoadNature Class See Also
---
The LoadNature type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new LoadNature. |

# See Also
LoadNature Class
Autodesk.Revit.DB.Structure Namespace