# SymbolGeometryId Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SymbolGeometryId Methods
SymbolGeometryId Class See Also
---
The SymbolGeometryId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AsUniqueIdentifier | Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element. |
| Dispose |

# See Also
SymbolGeometryId Class
Autodesk.Revit.DB Namespace