# RevisionNumberingSequence Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevisionNumberingSequence Properties
RevisionNumberingSequence Class See Also
---
The RevisionNumberingSequence type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NumberType | Indicates the revision number type of the revision numbering sequence. |
| SequenceName | The name of this revision numbering sequence. |

# See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace