# SelectionUIOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SelectionUIOptions Methods
SelectionUIOptions Class See Also
---
The SelectionUIOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| ElementSelectsAsPinned | Checks whether the specified element will be treated as pinned for the purposes of selection. |
| GetSelectionUIOptions | Returns the current user's SelectionOptions. |

# See Also
SelectionUIOptions Class
Autodesk.Revit.UI Namespace