# AssetSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetSet Properties
AssetSet Class See Also
---
The AssetSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty |
| Size |

# See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace