# RebarShapeConstraintRadius Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintRadius Members
RebarShapeConstraintRadius Class Constructors Methods Properties See Also
---
The RebarShapeConstraintRadius type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraintRadius | Create a radius constraint. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ArcReferenceType | The choice of rule for measuring the radius. |

# See Also
RebarShapeConstraintRadius Class
Autodesk.Revit.DB.Structure Namespace