# FabricationAncillaryUsage Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationAncillaryUsage Methods
FabricationAncillaryUsage Class See Also
---
The FabricationAncillaryUsage type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace