# SpacingRule Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpacingRule Methods
SpacingRule Class See Also
---
The SpacingRule type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetLayoutFixedDistance | Set the Layout property to FixedDistance. |
| SetLayoutFixedNumber | Set the Layout property to FixedNumber. |
| SetLayoutMaximumSpacing | Set the Layout property to MaximumSpacing. |
| SetLayoutMinimumSpacing | Set the Layout property to MinimumSpacing. |
| SetLayoutNone | Set the Layout property to None. |

# See Also
SpacingRule Class
Autodesk.Revit.DB Namespace