# RadioButtonGroup Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RadioButtonGroup Properties
RadioButtonGroup Class See Also
---
The RadioButtonGroup type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets or sets the current checked ToggleButton of the RadioButtonGroup. |

# See Also
RadioButtonGroup Class
Autodesk.Revit.UI Namespace