# StructuralSectionGeneralLA Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionGeneralLA Members
StructuralSectionGeneralLA Class Constructors Methods Properties See Also
---
The StructuralSectionGeneralLA type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| StructuralSectionGeneralLA | Creates a new instance of Angle Cold Formed shape. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LipLength | Lip segment length. |

# See Also
StructuralSectionGeneralLA Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace