# AnalysisDisplayColoredSurfaceSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisDisplayColoredSurfaceSettings Methods
AnalysisDisplayColoredSurfaceSettings Class See Also
---
The AnalysisDisplayColoredSurfaceSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| IsEqual | Compares two colored surface settings objects. |

# See Also
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace