# EnableMarqueeProgressBar Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TaskDialog..::..EnableMarqueeProgressBar Property
TaskDialog Class See Also
---
Enables a marquee style progress bar to be displayed in the TaskDialog.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool EnableMarqueeProgressBar { get; set; }
```

Visual Basic
---
```text
Public Property EnableMarqueeProgressBar As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool EnableMarqueeProgressBar {
	bool get ();
	void set (bool value);
}
```

# Remarks
When true, the TaskDialog will display a progress bar that has an indeterminate start and stop.
A progress bar is a window that an application can use to indicate the progress of a lengthy operation.
It consists of a rectangle that is animated as an operation progresses. The animation continues until the TaskDialog is closed.
The default value is false.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the TaskDialog also has ExtraCheckBoxText set as the two cannot coincide in the same TaskDialog. |

# See Also
TaskDialog Class
Autodesk.Revit.UI Namespace