# ExternalResourceSubFolder Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceSubFolder Methods
ExternalResourceSubFolder Class See Also
---
The ExternalResourceSubFolder type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ExternalResourceSubFolder Class
Autodesk.Revit.DB Namespace