# VertexIndexPairArrayIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexIndexPairArrayIterator Properties
VertexIndexPairArrayIterator Class See Also
---
The VertexIndexPairArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
VertexIndexPairArrayIterator Class
Autodesk.Revit.DB Namespace