# FamilyParameterSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyParameterSetIterator Properties
FamilyParameterSetIterator Class See Also
---
The FamilyParameterSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
FamilyParameterSetIterator Class
Autodesk.Revit.DB Namespace