# ICodeCheckingParameterServer Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ICodeCheckingParameterServer Methods
ICodeCheckingParameterServer Interface See Also
---
The ICodeCheckingParameterServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PerformCodeChecking | The server's method that will be called when Revit User clicks the Code Checking parameter's button from the properties palette. |

# See Also
ICodeCheckingParameterServer Interface
Autodesk.Revit.DB.Structure Namespace