# TypeBinding Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TypeBinding Members
TypeBinding Class Constructors Methods Properties See Also
---
The TypeBinding type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TypeBinding()()()() | Constructs an empty type binding. |
| TypeBinding(CategorySet) | Constructs a type binding with the set of categories passed. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
TypeBinding Class
Autodesk.Revit.DB Namespace