# LoadBase Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadBase Methods
LoadBase Class See Also
---
The LoadBase type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsOrientToPermitted | Indicates if the provided orientation is permitted for this load. |
| RemoveHostConstraint | Removes constraint from host for this load. |

# See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace