# AssetPropertyEnum Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyEnum Members
AssetPropertyEnum Class Methods Properties See Also
---
The AssetPropertyEnum type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidValue | Checks that the value is a valid value for this property. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The value of the property. |

# See Also
AssetPropertyEnum Class
Autodesk.Revit.DB.Visual Namespace