# RebarWorkInstructions Enumeration

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarWorkInstructions Enumeration
See Also
---
Describes how a Free Form Rebar will be fabricated.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018 **Since:** 2018
# Syntax
C#
---
```text
public enum RebarWorkInstructions
```

Visual Basic
---
```text
Public Enumeration RebarWorkInstructions
```

Visual C++
---
```text
public enum class RebarWorkInstructions
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| Bent | The bar will be bent in the shop. It will be matched to an existing Rebar Shape. If it can't be matched to an existing one a matching one will be created if it is possible. |
| Straight | The bar will be delivered as a straight bar to the site and the shape code is one of the straight Rebar Shapes loaded into the project (e.g. 00). |

# See Also
Autodesk.Revit.DB.Structure Namespace