# CentralModelContentionException Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CentralModelContentionException Properties
CentralModelContentionException Class See Also
---
The CentralModelContentionException type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentUser | Retrieves current user name. |

# See Also
CentralModelContentionException Class
Autodesk.Revit.Exceptions Namespace