# TilePatterns Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TilePatterns Members
TilePatterns Class Methods Properties See Also
---
The TilePatterns type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetTilePattern | Retrieve a TilePattern object from a built-in type. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
TilePatterns Class
Autodesk.Revit.DB Namespace