# IFCFamilyInstanceExtrusionExportResults Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCFamilyInstanceExtrusionExportResults Methods
IFCFamilyInstanceExtrusionExportResults Class See Also
---
The IFCFamilyInstanceExtrusionExportResults type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCutPairOpenings | Gets the set of "openings" determined from the analysis of the instance geometry. |
| GetExtrusionHandle | Gets the extruded solid handle generated for the family instance. |

# See Also
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace