# GroupSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GroupSetIterator Properties
GroupSetIterator Class See Also
---
The GroupSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
GroupSetIterator Class
Autodesk.Revit.DB Namespace