# Sketch Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Sketch Properties
Sketch Class See Also
---
The Sketch type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OwnerId | Returns id of the sketch owner element or invalidElementId if sketch does not build a geometry. |
| Profile | Returns the Profile of the Sketch. |
| SketchPlane | Returns the Sketch Plane of the Sketch. |

# See Also
Sketch Class
Autodesk.Revit.DB Namespace