# InsulationLiningBase Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InsulationLiningBase Properties
InsulationLiningBase Class See Also
---
The InsulationLiningBase type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HostElementId | The id of the host element for the insulation or lining element. |
| Thickness | Thickness of the insulation or lining element. |

# See Also
InsulationLiningBase Class
Autodesk.Revit.DB Namespace