# ValueParsingOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ValueParsingOptions Methods
ValueParsingOptions Class See Also
---
The ValueParsingOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetFormatOptions | Gets the FormatOptions to optionally override the default settings in the Units class. |
| SetFormatOptions | Sets the FormatOptions to optionally override the default settings in the Units class. |

# See Also
ValueParsingOptions Class
Autodesk.Revit.DB Namespace