# PlanViewRange Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanViewRange Methods
PlanViewRange Class See Also
---
The PlanViewRange type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetLevelId | Get the element id of the level for a View Depth plane |
| GetOffset | Get the offset value associated with a View Depth plane |
| SetLevelId | Set the level for a View Depth plane |
| SetOffset | Set the offset value associated with a View Depth plane |

# See Also
PlanViewRange Class
Autodesk.Revit.DB Namespace