# RebarShapeConstraintChordLength Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintChordLength Members
RebarShapeConstraintChordLength Class Constructors Methods Properties See Also
---
The RebarShapeConstraintChordLength type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraintChordLength | Create a constraint to drive chord length. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
RebarShapeConstraintChordLength Class
Autodesk.Revit.DB.Structure Namespace