# VertexPositionNormalColored Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexPositionNormalColored Methods
VertexPositionNormalColored Class See Also
---
The VertexPositionNormalColored type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetColor | Gets the vertex's color. |
| GetSizeInFloats | Gets the amount of storage that the vertex takes up in a buffer, measured in floats. |
| SetColor | Sets the vertex's color. |

# See Also
VertexPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace