# Equals Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralAsset..::..Equals Method
StructuralAsset Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals(StructuralAsset) | Determines whether this structural asset is equal to another. |

# See Also
StructuralAsset Class
StructuralAsset Members
Autodesk.Revit.DB Namespace