# FileArgumentNotFoundException Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileArgumentNotFoundException Members
FileArgumentNotFoundException Class Methods Properties See Also
---
The FileArgumentNotFoundException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ArgumentException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FileArgumentNotFoundException Class
Autodesk.Revit.Exceptions Namespace