# RoofBase Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoofBase Methods
RoofBase Class See Also
---
The RoofBase type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSlabShapeEditor | Gets a SlabShapeEditor that can used to add or modify points of this RoofBase. |

# See Also
RoofBase Class
Autodesk.Revit.DB Namespace