# WireSizeSetIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireSizeSetIterator Methods
WireSizeSetIterator Class See Also
---
The WireSizeSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
WireSizeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace