# ForbiddenForDynamicUpdateException Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ForbiddenForDynamicUpdateException Members
ForbiddenForDynamicUpdateException Class Methods Properties See Also
---
The ForbiddenForDynamicUpdateException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ForbiddenForDynamicUpdateException Class
Autodesk.Revit.Exceptions Namespace