# FileArgumentAlreadyExistsException Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileArgumentAlreadyExistsException Members
FileArgumentAlreadyExistsException Class Methods Properties See Also
---
The FileArgumentAlreadyExistsException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ArgumentException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FileArgumentAlreadyExistsException Class
Autodesk.Revit.Exceptions Namespace