# FilledRegion Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilledRegion Properties
FilledRegion Class See Also
---
The FilledRegion type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsMasking | Indicates whether this element is a 'Filled Region or a 'Masking Region'. |

# See Also
FilledRegion Class
Autodesk.Revit.DB Namespace