# CADLinkType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CADLinkType Methods
CADLinkType Class See Also
---
The CADLinkType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LoadFrom(String) | Loads or reloads the DWG link from the given file path. |
| LoadFrom(ExternalResourceReference) | Loads or reloads the DWG link from the given external resource reference. |
| Reload()()()() | Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link. |
| Reload(CADLinkOptions) | Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link. |

# See Also
CADLinkType Class
Autodesk.Revit.DB Namespace