# EnergyAnalysisWindowType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EnergyAnalysisWindowType Methods
EnergyAnalysisWindowType Class See Also
---
The EnergyAnalysisWindowType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSolarHeatGainCoefficientsForSolarIndicientAngles | Returns a map with solar heat gain coefficients (SHGC-values) for specific incident angles for the window type. |

# See Also
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace