# DoubleArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DoubleArray Properties
DoubleArray Class See Also
---
The DoubleArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a double at a specified index within the array. |
| Size | Returns the number of doubles that are in the array. |

# See Also
DoubleArray Class
Autodesk.Revit.DB Namespace