# ParameterMapIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterMapIterator Properties
ParameterMapIterator Class See Also
---
The ParameterMapIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |
| Key | Retrieves the key that is the current focus of the iterator. |

# See Also
ParameterMapIterator Class
Autodesk.Revit.DB Namespace