# ValueAtPoint Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ValueAtPoint Members
ValueAtPoint Class Constructors Methods Properties See Also
---
The ValueAtPoint type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ValueAtPoint(IList<(Of <<'(Double>)>>)) | Creates object from an array of values |
| ValueAtPoint(ValueAtPoint) | Creates a copy of the given ValueAtPoint instance. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ValueAtPoint Class
Autodesk.Revit.DB.Analysis Namespace