# BaseArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BaseArray Properties
BaseArray Class See Also
---
The BaseArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Label | The family parameter label of the BaseArray. |
| Name | Get and Set the Name property (Overrides Element..::..Name.) |
| NumMembers | Retrieves or changes the number of the arrayed members. |

# See Also
BaseArray Class
Autodesk.Revit.DB Namespace