# DocumentPreviewSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentPreviewSettings Methods
DocumentPreviewSettings Class See Also
---
The DocumentPreviewSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| ForceViewUpdate | Sets Revit to update the preview view if necessary. |
| IsViewIdValidForPreview | Identifies if the view id is valid as a preview view id. |

# See Also
DocumentPreviewSettings Class
Autodesk.Revit.DB Namespace