# ApplicationException Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationException Members
ApplicationException Class Methods Properties See Also
---
The ApplicationException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides Exception..::..GetObjectData(SerializationInfo, StreamingContext).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FunctionId | The information of the function throwing the exception. |

# See Also
ApplicationException Class
Autodesk.Revit.Exceptions Namespace