# ImageView Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImageView Members
ImageView Class Methods Properties See Also
---
The ImageView type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Create an ImageView containing an image imported from disk. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ImageInstanceId | Id of the image in the view. |

# See Also
ImageView Class
Autodesk.Revit.DB Namespace