# Sketch Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Sketch Methods
Sketch Class See Also
---
The Sketch type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAllElements | Returns all elements which belong to the sketch. |

# See Also
Sketch Class
Autodesk.Revit.DB Namespace