# MultiReferenceAnnotation Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MultiReferenceAnnotation Properties
MultiReferenceAnnotation Class See Also
---
The MultiReferenceAnnotation type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DimensionId | The child dimension owned by this multi-reference annotation. |
| TagId | The child IndependentTag owned by this multi-reference annotation. |

# See Also
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace