# ToggleButtonData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ToggleButtonData Members
ToggleButtonData Class Constructors Methods Properties See Also
---
The ToggleButtonData type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ToggleButtonData(String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand. |
| ToggleButtonData(String, String, String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
ToggleButtonData Class
Autodesk.Revit.UI Namespace