# GetDesignElementAndFabricationPartsWithOpenConnectors Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DesignToFabricationConverter..::..GetDesignElementAndFabricationPartsWithOpenConnectors Method
DesignToFabricationConverter Class See Also
---
Gets the collection of design elements that failed to convert and the associated set of fabrication parts with open connectors.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IDictionary<ElementId, ISet<ElementId>> GetDesignElementAndFabricationPartsWithOpenConnectors()
```

Visual Basic
---
```text
Public Function GetDesignElementAndFabricationPartsWithOpenConnectors As IDictionary(Of ElementId, ISet(Of ElementId))
```

Visual C++
---
```text
public:
IDictionary<ElementId^, ISet<ElementId^>^>^ GetDesignElementAndFabricationPartsWithOpenConnectors()
```

# ### Return Value
A map of design element identifiers that were not converted and the associated set fabrication parts left with open connectors.
# Remarks
This set of element identifiers is only available after the **Convert** method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
# See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace