# AnalyticalPanel Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalPanel Methods
AnalyticalPanel Class See Also
---
The AnalyticalPanel type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, CurveLoop) | Creates a new instance of an Analytical Panel within the project. |
| Create(Document, Curve, XYZ) | Creates a new instance of an Analytical Panel within the project. |
| GetAnalyticalOpeningsIds | Returns the Analytical Openings ids of the Analytical Panel. |

# See Also
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace