# VertexPositionNormal Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexPositionNormal Methods
VertexPositionNormal Class See Also
---
The VertexPositionNormal type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSizeInFloats | Gets the amount of storage that the vertex takes up in a buffer, measured in floats. |

# See Also
VertexPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace