# DoubleParameterValue Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DoubleParameterValue Members
DoubleParameterValue Class Constructors Methods Properties See Also
---
The DoubleParameterValue type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DoubleParameterValue()()()() | Default constructor |
| DoubleParameterValue(Double) | Value constructor |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The stored value |

# See Also
DoubleParameterValue Class
Autodesk.Revit.DB Namespace