# KeyBasedTreeEntry Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeyBasedTreeEntry Methods
KeyBasedTreeEntry Class See Also
---
The KeyBasedTreeEntry type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetChildrenKeys | Gets a collection containing the keys of all children entry objects from this entry. |

# See Also
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace