# TransactWithCentralOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TransactWithCentralOptions Methods
TransactWithCentralOptions Class See Also
---
The TransactWithCentralOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetLockCallback | Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model. |
| SetLockCallback | Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model. |

# See Also
TransactWithCentralOptions Class
Autodesk.Revit.DB Namespace