# BalusterPlacement Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BalusterPlacement Methods
BalusterPlacement Class See Also
---
The BalusterPlacement type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace