# FilterElementIdRule Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterElementIdRule Methods
FilterElementIdRule Class See Also
---
The FilterElementIdRule type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| UsesLevelFiltering | This function checks if a parameter uses level filtering. |

# See Also
FilterElementIdRule Class
Autodesk.Revit.DB Namespace