# MacroManagerIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MacroManagerIterator Methods
MacroManagerIterator Class See Also
---
The MacroManagerIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | Returns the current Macro module. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |

# See Also
MacroManagerIterator Class
Autodesk.Revit.DB.Macros Namespace