# RebarShapeConstraintSegmentLength Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintSegmentLength Methods
RebarShapeConstraintSegmentLength Class See Also
---
The RebarShapeConstraintSegmentLength type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSegmentEndReferenceType | Choice of two possibilities for the start and end references of the length constraint. |

# See Also
RebarShapeConstraintSegmentLength Class
Autodesk.Revit.DB.Structure Namespace