# CurveArray Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveArray Methods
CurveArray Class See Also
---
The CurveArray type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Append | Add the curve to the end of the array. |
| Clear | Removes every curve from the array, rendering it empty. |
| ForwardIterator | Retrieve a forward moving iterator to the array. |
| GetEnumerator | Retrieve a forward moving iterator to the array. |
| Insert | Insert the specified curve into the array. |
| ReverseIterator | Retrieve a backward moving iterator to the array. |

# See Also
CurveArray Class
Autodesk.Revit.DB Namespace