# RebarShapeConstraintDiameter Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintDiameter Members
RebarShapeConstraintDiameter Class Constructors Methods Properties See Also
---
The RebarShapeConstraintDiameter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraintDiameter | Create a diameter constraint. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ArcReferenceType | The choice of rule for measuring the diameter. |

# See Also
RebarShapeConstraintDiameter Class
Autodesk.Revit.DB.Structure Namespace