# TemperatureRatingTypeSetIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TemperatureRatingTypeSetIterator Methods
TemperatureRatingTypeSetIterator Class See Also
---
The TemperatureRatingTypeSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
TemperatureRatingTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace