# SlabShapeVertex Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SlabShapeVertex Members
SlabShapeVertex Class Methods Properties See Also
---
The SlabShapeVertex type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Position | The position of the vertex. |
| VertexType | The type of the vertex. |

# See Also
SlabShapeVertex Class
Autodesk.Revit.DB Namespace