# HostObjAttributes Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HostObjAttributes Methods
HostObjAttributes Class See Also
---
The HostObjAttributes type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetCompoundStructure | Returns an object that represents the compound structure of the element. |
| SetCompoundStructure | Sets the compound structure of the element. |

# See Also
HostObjAttributes Class
Autodesk.Revit.DB Namespace