# KeynoteTable Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeynoteTable Methods
KeynoteTable Class See Also
---
The KeynoteTable type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetKeynoteTable | Gets the KeynoteTable from a Revit document. |

# See Also
KeynoteTable Class
Autodesk.Revit.DB Namespace