# EnergyAnalysisSurface Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EnergyAnalysisSurface Properties
EnergyAnalysisSurface Class See Also
---
The EnergyAnalysisSurface type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Azimuth | The azimuth angle for this surface. |
| CADLinkUniqueId | The unique id of the originating CAD object's link (linked document) associated with this surface. |
| CADObjectUniqueId | The unique id of the originating CAD object (model element) associated with this surface. |
| Corner | The lower-left coordinate for the analytical rectangular geometry viewed from outside. |
| Height | The height of the analytical rectangular geometry. |
| Normal | The outward normal for this surface. |
| OriginatingElementDescription | The description for the originating Revit element. |
| OriginatingElementId | The element id for the originating Revit element. |
| OriginatingElementName | The name for the originating Revit element. |
| SurfaceId | The unique identifier for the surface. |
| SurfaceName | The unique name identifier for this surface. |
| SurfaceType | The analytical surface type. |
| Tilt | The tilt angle for this surface. |
| Type | The gbXML surface type attribute. |
| Width | The width of the analytical rectangular geometry. |

# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace