# FileArgumentAlreadyExistsException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileArgumentAlreadyExistsException Methods
FileArgumentAlreadyExistsException Class See Also
---
The FileArgumentAlreadyExistsException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides ArgumentException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
FileArgumentAlreadyExistsException Class
Autodesk.Revit.Exceptions Namespace