# MechanicalEquipmentSetType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MechanicalEquipmentSetType Members
MechanicalEquipmentSetType Class Methods Properties See Also
---
The MechanicalEquipmentSetType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new type of a mechanical equipment set and adds it to the document. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
MechanicalEquipmentSetType Class
Autodesk.Revit.DB.Mechanical Namespace