# LeaderEndPosition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..LeaderEndPosition Property
Dimension Class See Also
---
The position of the dimension's leader end point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public XYZ LeaderEndPosition { get; set; }
```

Visual Basic
---
```text
Public Property LeaderEndPosition As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ LeaderEndPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
This property is not applicable to all dimensions. For example, it is not available for spot slope dimensions, multi-segments dimensions, dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property throws InvalidOperationException.
Notes for SpotDimension:
  * This property throws InvalidOperationException if dimension has no leader.
  * Setting of this property works differently for leader with and without shoulder.
  * If leader has shoulder, setting is limited by points on line between leader end and shoulder points (projected point is used).
  * Setting of this property also affects TextPosition.

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Dimension must have leader. -or- Thrown when: |

  * SpotDimension style type is SpotSlope.
  * Using equality formula.
  * Dimension style is ordinate.

-or- Thrown when:
  * SpotDimension has more than one segments.

-or-
# See Also
Dimension Class
Autodesk.Revit.DB Namespace