# ConnectionValidationInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectionValidationInfo Methods
ConnectionValidationInfo Class See Also
---
The ConnectionValidationInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetWarning | Access specific warning number of warnings generated by reload. |
| IsValidWarningIndex | Validate warning index. |
| ManyWarnings | Returns number of warnings generated by reload. |

# See Also
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace