# PointCloudOverrideSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudOverrideSettings Methods
PointCloudOverrideSettings Class See Also
---
The PointCloudOverrideSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Assign | Assigns values of the source settings to this object. |
| Dispose |
| GetModeOverride | Lookup color settings for the given color mode. |
| IsEqual | Checks if the contents of two settings are equal. |
| SetModeOverride | Sets color settings for the given color mode. |

# See Also
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace