# ExternalResourceServerExtensions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceServerExtensions Methods
ExternalResourceServerExtensions Class See Also
---
The ExternalResourceServerExtensions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCADLinkOperations | Gets the specific methods supported by external resource CAD Links. |
| GetRevitLinkOperations | Gets the specific methods supported by the external resource of Revit Links. |

# See Also
ExternalResourceServerExtensions Class
Autodesk.Revit.DB Namespace