# Segment Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Segment Methods
Segment Class See Also
---
The Segment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddSize | Adds a new MEPSize to the segment. |
| GetSizes | Gets the defined sizes of the segment. |
| RemoveSize | Remove the existing MEPSize with this nominal diameter from the segment. |

# See Also
Segment Class
Autodesk.Revit.DB Namespace