# ExternalEvent Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalEvent Methods
ExternalEvent Class See Also
---
The ExternalEvent type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates an instance of external event. |
| CreateJournalable | Creates an instance of external event which will have the ability to record its executions in the journal. |
| Dispose |
| Raise | Instructing Revit to raise (signal) the external event. |

# See Also
ExternalEvent Class
Autodesk.Revit.UI Namespace