# AreaVolumeSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaVolumeSettings Properties
AreaVolumeSettings Class See Also
---
The AreaVolumeSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ComputeVolumes | True to enable volume computation. False to disable it. |

# See Also
AreaVolumeSettings Class
Autodesk.Revit.DB Namespace