# RevitLinkOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitLinkOptions Methods
RevitLinkOptions Class See Also
---
The RevitLinkOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetWorksetConfiguration | Gets the set of worksets to open when creating the link. |
| SetWorksetConfiguration | Sets the set of worksets to open when creating the link. |

# See Also
RevitLinkOptions Class
Autodesk.Revit.DB Namespace