# CustomFieldData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CustomFieldData Methods
CustomFieldData Class See Also
---
The CustomFieldData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCustomFieldId | Gets an unique identifier of the custom field. |
| GetCustomFieldProperties | Gets an instance of ICustomFieldProperties which represents the properties of this field. |
| SetCustomFieldProperties | Sets an instance of ICustomFieldProperties which represents the properties of this field. |
| ValidateCustomFieldProperties | Validates the custom field properties. |

# See Also
CustomFieldData Class
Autodesk.Revit.DB Namespace