# DesignOption Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DesignOption Methods
DesignOption Class See Also
---
The DesignOption type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetActiveDesignOptionId | Gets the active design option id for the current design option set. |

# See Also
DesignOption Class
Autodesk.Revit.DB Namespace