# GetInstanceGeometry Method (Transform)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryInstance..::..GetInstanceGeometry Method (Transform)
GeometryInstance Class See Also
---
Computes a transformation of the geometric representation of the instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GeometryElement GetInstanceGeometry(
	Transform transform
)
```

Visual Basic
---
```text
Public Function GetInstanceGeometry ( _
	transform As Transform _
) As GeometryElement
```

Visual C++
---
```text
public:
GeometryElement^ GetInstanceGeometry(
	Transform^ transform
)
```

# ### Parameters
transform
    Type: Autodesk.Revit.DB..::..TransformThe transformation to apply to the geometry.
# ### Return Value
An element which contains the computed geometry for the transformed instance.
# Remarks
The context of the instance object (such as effective material) will be applied to the symbol. Note that this method involves extensive parsing or Revit's data structures, so try to minimize calls if performance is critical. Geometry will be parsed with the same options as those used when this object was retrieved. This method returns a copy of the Revit geometry. It is suitable for use in a tool which extracts geometry to another format or carries out a geometric analysis; however, because it returns a copy the references found in the geometry objects contained in this element are not suitable for creating new Revit elements referencing the original element (for example, dimensioning). Only the geometry returned by GetSymbolGeometry() with no transform can be used for that purpose.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Transform is not conformal |

# See Also
GeometryInstance Class
GetInstanceGeometry Overload
Autodesk.Revit.DB Namespace