# AutoJoinFailedException Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AutoJoinFailedException Methods
AutoJoinFailedException Class See Also
---
The AutoJoinFailedException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides InvalidOperationException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# See Also
AutoJoinFailedException Class
Autodesk.Revit.Exceptions Namespace