# GeomCombinationSetIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GeomCombinationSetIterator Methods
GeomCombinationSetIterator Class See Also
---
The GeomCombinationSetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# See Also
GeomCombinationSetIterator Class
Autodesk.Revit.DB Namespace