# CircuitNamingSchemeSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CircuitNamingSchemeSettings Properties
CircuitNamingSchemeSettings Class See Also
---
The CircuitNamingSchemeSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CircuitNamingSchemeId | The circuit naming scheme id set in CircuitNamingSchemeSettings. |

# See Also
CircuitNamingSchemeSettings Class
Autodesk.Revit.DB.Electrical Namespace