# LinearArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinearArray Properties
LinearArray Class See Also
---
The LinearArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NumMembers | Retrieves or changes the number of the arrayed members. (Overrides BaseArray..::..NumMembers.) |

# See Also
LinearArray Class
Autodesk.Revit.DB Namespace