# MechanicalSystemType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MechanicalSystemType Methods
MechanicalSystemType Class See Also
---
The MechanicalSystemType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of a mechanical system type and adds it to the document. |
| ValidateRiseDropSymbolType | Confirms if the parameter is a valid HVAC rise/drop symbol type. |

# See Also
MechanicalSystemType Class
Autodesk.Revit.DB.Mechanical Namespace