# INavisworksExporter Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
INavisworksExporter Methods
INavisworksExporter Interface See Also
---
The INavisworksExporter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Export | The method that Revit will invoke to perform an export to Navisworks. |
| ValidateExportOptions | Determines if the inputs are valid, and returns an error message if not. |

# See Also
INavisworksExporter Interface
Autodesk.Revit.DB Namespace