# StructuralSectionLAngle Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionLAngle Properties
StructuralSectionLAngle Class See Also
---
The StructuralSectionLAngle type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BoltDiameterLongerFlange | Maximum bolt hole diameter in the longer flange, in. (mm) |
| BoltDiameterShorterFlange | Maximum bolt hole diameter in the shorter flange, in. (mm) |
| BoltSpacing1LongerFlange | Standard bolt spacing first row in the longer flange, in. (mm) |
| BoltSpacing2LongerFlange | Standard bolt spacing second row in the longer flange, in. (mm) |
| BoltSpacingShorterFlange | Standard bolt spacing in the shorter flange, in. (mm) |

# See Also
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace