# ReinforcementRoundingManager Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReinforcementRoundingManager Methods
ReinforcementRoundingManager Class See Also
---
The ReinforcementRoundingManager type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetLengthUnitTypeId | Gets the identifier of the length unit quantifying the reinforcement rounding values. |

# See Also
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace