# FilterNumericGreater Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterNumericGreater Members
FilterNumericGreater Class Constructors Methods Properties See Also
---
The FilterNumericGreater type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterNumericGreater | Constructs an instance of FilterNumericGreater. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
FilterNumericGreater Class
Autodesk.Revit.DB Namespace