# VertexIndexPairArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexIndexPairArray Properties
VertexIndexPairArray Class See Also
---
The VertexIndexPairArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a VertexIndex pair at a specified index within the array. |
| Size | Returns the number of VertexIndex pairs that are in the array. |

# See Also
VertexIndexPairArray Class
Autodesk.Revit.DB Namespace