# HasValueFilterRule Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HasValueFilterRule Members
HasValueFilterRule Class Constructors Methods Properties See Also
---
The HasValueFilterRule type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HasValueFilterRule | constructs an instance of HasValueFilterRule. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
HasValueFilterRule Class
Autodesk.Revit.DB Namespace