# FabricationConfigurationInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationConfigurationInfo Methods
FabricationConfigurationInfo Class See Also
---
The FabricationConfigurationInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| FindSourceFabricationConfiguration | Finds the source fabrication configuration on disk which matches the input fabrication configuration. |
| GetAllFabricationConfigurations | Gets all added fabrication configurations. |
| GetProfiles | Return the profiles in the fabrication configuration. |
| IsValid | Checks if the fabrication configuration is valid. |

# See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace