# AssemblyMemberDifferentType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyMemberDifferentType Members
AssemblyMemberDifferentType Class Methods Properties See Also
---
The AssemblyMemberDifferentType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TypeId1 | Type id of the first assembly member |
| TypeId2 | Type id of the second assembly member |

# See Also
AssemblyMemberDifferentType Class
Autodesk.Revit.DB Namespace