# InvalidDataStreamException Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InvalidDataStreamException Members
InvalidDataStreamException Class Methods Properties See Also
---
The InvalidDataStreamException type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetObjectData | Retrieves data needed to serialize the target object. (Overrides IOException..::..GetObjectData(SerializationInfo, StreamingContext).) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
InvalidDataStreamException Class
Autodesk.Revit.Exceptions Namespace