# AnalysisDisplayColorSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisDisplayColorSettings Methods
AnalysisDisplayColorSettings Class See Also
---
The AnalysisDisplayColorSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreIntermediateColorsValid | Verify intermediate color entries |
| Colors | Get number of colors, including min, max and intermediate. |
| Dispose |
| GetIntermediateColors | Get intermediate color entries (other than the minimum and maximum settings). |
| IsEqual | Compares two color settings objects. |
| SetIntermediateColors | Set intermediate color entries (other than the minimum and maximum settings). |

# See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace