# LayoutRuleFixedNumber Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LayoutRuleFixedNumber Members
LayoutRuleFixedNumber Class Constructors Methods Properties See Also
---
The LayoutRuleFixedNumber type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LayoutRuleFixedNumber | Constructor of LayoutRuleFixedNumber. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NumberOfLines | Get or set the number of the beams in a beam system. |

# See Also
LayoutRuleFixedNumber Class
Autodesk.Revit.DB Namespace