# RadioButtonGroup Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RadioButtonGroup Methods
RadioButtonGroup Class See Also
---
The RadioButtonGroup type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddItem | Adds a new ToggleButton to the RadioButtonGroup. |
| AddItems | Adds new ToggleButtons to the RadioButtonGroup. |
| GetItems | Gets the collection of ToggleButtons assigned to the RadioButtonGroup. |

# See Also
RadioButtonGroup Class
Autodesk.Revit.UI Namespace