# PointOnEdgeEdgeIntersection Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointOnEdgeEdgeIntersection Methods
PointOnEdgeEdgeIntersection Class See Also
---
The PointOnEdgeEdgeIntersection type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetEdgeReference1 | Get a copy of the first edge or curve reference. |
| GetEdgeReference2 | Get a copy of the second edge or curve reference. |
| SetEdgeReference1 | Change the first edge or curve reference. |
| SetEdgeReference2 | Change the second edge or curve reference. |

# See Also
PointOnEdgeEdgeIntersection Class
Autodesk.Revit.DB Namespace