# ContextualHelp Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ContextualHelp Methods
ContextualHelp Class See Also
---
The ContextualHelp type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Launch | Launches and displays the help topic specified by the contents of this ContextualHelp object. |

# See Also
ContextualHelp Class
Autodesk.Revit.UI Namespace