# Segment Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Segment Properties
Segment Class See Also
---
The Segment type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Description | The description of the segment. |
| MaterialId | The ElementId of the MaterialElem. |
| Roughness | The roughness value for given material. |
| SizeCount | The number of size objects in the segment. |

# See Also
Segment Class
Autodesk.Revit.DB Namespace