# FabricationVersionInfo Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationVersionInfo Members
FabricationVersionInfo Class Methods Properties See Also
---
The FabricationVersionInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FabricationVersionInfo |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Reason | The user-specified reason for the change. |
| Version | The version number of the change. |

# See Also
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace