# ElementWorksetFilter Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementWorksetFilter Properties
ElementWorksetFilter Class See Also
---
The ElementWorksetFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| WorksetId | The workset id. |

# See Also
ElementWorksetFilter Class
Autodesk.Revit.DB Namespace