# FamilyLoadedIntoDocumentEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyLoadedIntoDocumentEventArgs Properties
FamilyLoadedIntoDocumentEventArgs Class See Also
---
The FamilyLoadedIntoDocumentEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilyName | The file name of the family that is loaded into the document. |
| FamilyPath | The file path of the family that is loaded into the document. |
| NewFamilyId | The newly loaded family id. |
| OriginalFamilyId | The original family id that is overridden by the newly loaded family. |

# See Also
FamilyLoadedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace