# AssetPropertyBoolean Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyBoolean Properties
AssetPropertyBoolean Class See Also
---
The AssetPropertyBoolean type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The value of the property. |

# See Also
AssetPropertyBoolean Class
Autodesk.Revit.DB.Visual Namespace