# ZoneElementDomainData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ZoneElementDomainData Methods
ZoneElementDomainData Class See Also
---
The ZoneElementDomainData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
ZoneElementDomainData Class
Autodesk.Revit.DB.Mechanical Namespace