# FamilyTypeSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyTypeSet Properties
FamilyTypeSet Class See Also
---
The FamilyTypeSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of objects that are in the set. |

# See Also
FamilyTypeSet Class
Autodesk.Revit.DB Namespace