# ViewDisplayBackgroundType Enumeration

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayBackgroundType Enumeration
See Also
---
A collection of settings defining the type of the view background
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public enum ViewDisplayBackgroundType
```

Visual Basic
---
```text
Public Enumeration ViewDisplayBackgroundType
```

Visual C++
---
```text
public enum class ViewDisplayBackgroundType
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| None | No background defined - the color from Options is used to fill it. |
| Gradient | Three-color simulated sky-horizon-ground combination. The sky is drawn in gradually changing color from the top (the "sky" color) to the bottom (the "horizon" color). The ground is either drawn in the single (the "ground") color, if the sky is visible, or in a gradient from the top (the "horizon") color to the bottom (the "ground") color. |
| Image | User-specified image is drawn in the background either stretched vertically/horizontally/in both directions, or as is (pixel-to-pixel). |
| SunAndClouds | Best approximation to the colors of the sky and the visible sun disk. The position of the visible sun disk is calculated based on the "sun and shadow settings" (see 'ViewBackgroundLighting' object). |

# See Also
Autodesk.Revit.DB Namespace