# ViewSheet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewSheet Properties
ViewSheet Class See Also
---
The ViewSheet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsPlaceholder | Identifies whether or not the view sheet represents a placeholder sheet. |
| SheetNumber | The sheet number of the document. |

# See Also
ViewSheet Class
Autodesk.Revit.DB Namespace