# PaperSize Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PaperSize Properties
PaperSize Class See Also
---
The PaperSize type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Name | Retrieve the paper size name of current project. |

# See Also
PaperSize Class
Autodesk.Revit.DB Namespace