# MEPHiddenLineSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPHiddenLineSettings Methods
MEPHiddenLineSettings Class See Also
---
The MEPHiddenLineSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetMEPHiddenLineSettings | Gets the MEP hidden line settings in the document. |

# See Also
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace