# PipingSystemType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipingSystemType Methods
PipingSystemType Class See Also
---
The PipingSystemType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of a piping system type and adds it to the document. |
| ValidateRiseDropSymbolType | Confirms if the parameter is a valid piping rise/drop symbol type. |

# See Also
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace