# ElementParameterFilter Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementParameterFilter Methods
ElementParameterFilter Class See Also
---
The ElementParameterFilter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetRules | Returns the set of rules contained in this filter. |

# See Also
ElementParameterFilter Class
Autodesk.Revit.DB Namespace