# Dimension Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Dimension Methods
Dimension Class See Also
---
The Dimension type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HasOneSegment | Determines whether a dimension has one segment. |
| IsTextPositionAdjustable | Indicates if this dimension is supported to set/get TextPosition/LeaderEndPosition. |
| ResetTextPosition | Resets the text position of the dimension to the initial position determined by its type and parameters. |

# See Also
Dimension Class
Autodesk.Revit.DB Namespace