# ExternallyTaggedGeometryObject Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedGeometryObject Members
ExternallyTaggedGeometryObject Class Methods Properties See Also
---
The ExternallyTaggedGeometryObject type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ExternallyTaggedGeometryObject |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalId | The external Id of the geometry object. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ExternallyTaggedGeometryObject Class
Autodesk.Revit.DB Namespace