# IFCLevelInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCLevelInfo Methods
IFCLevelInfo Class See Also
---
The IFCLevelInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates an IFCLevelInfo. |
| Dispose |
| GetBuildingStorey | Gets the IfcBuildingStorey handle. |
| GetLocalPlacement | Gets the local placement. |
| GetRelatedElements | Gets all building elements on this level. |
| GetRelatedProducts | Gets all building products on this level. |

# See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace