# AdvancedLossFactor Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AdvancedLossFactor Properties
AdvancedLossFactor Class See Also
---
The AdvancedLossFactor type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BallastLossFactor | The ballast loss factor. |
| LampLumenDepreciation | The lamp lumen depreciation loss factor. |
| LampTiltLossFactor | The lamp tilt loss factor. |
| LuminaireDirtDepreciation | The luminaire dirt depreciation loss factor. |
| SurfaceDepreciationLossFactor | The surface depreciation loss factor. |
| TemperatureLossFactor | The temperature loss factor. |
| VoltageLossFactor | The voltage loss factor. |

# See Also
AdvancedLossFactor Class
Autodesk.Revit.DB.Lighting Namespace