# KeyBasedTreeEntries Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeyBasedTreeEntries Methods
KeyBasedTreeEntries Class See Also
---
The KeyBasedTreeEntries type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| FindEntry | Finds the KeyBasedTreeEntry associated with the given key value. |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |
| GetKeyBasedTreeEntriesIterator | Returns a KeyBasedTreeEntriesIterator that iterates through the collection. |

# See Also
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace