# ElementSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementSet Properties
ElementSet Class See Also
---
The ElementSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| Size | Returns the number of elements that are in the set. |

# See Also
ElementSet Class
Autodesk.Revit.DB Namespace