# JournalingAttribute Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
JournalingAttribute Properties
JournalingAttribute Class See Also
---
The JournalingAttribute type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Mode | Journaling mode. |

# See Also
JournalingAttribute Class
Autodesk.Revit.Attributes Namespace