# TableMergedCell Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableMergedCell Methods
TableMergedCell Class See Also
---
The TableMergedCell type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
TableMergedCell Class
Autodesk.Revit.DB Namespace