# RebarHookOrientation Enumeration

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHookOrientation Enumeration
See Also
---
Orientation of a rebar hook relative to the path of the Rebar Shape.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public enum RebarHookOrientation
```

Visual Basic
---
```text
Public Enumeration RebarHookOrientation
```

Visual C++
---
```text
public enum class RebarHookOrientation
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| Right | Hook towards the right of a segment-based shape (RebarShapeDefinitionBySegments), or to the exterior of an arc-based shape (RebarShapeDefinitionByArc). |
| Left | Hook towards the left of a segment-based shape (RebarShapeDefinitionBySegments), or to the interior of an arc-based shape (RebarShapeDefinitionByArc). |

# See Also
Autodesk.Revit.DB.Structure Namespace