# WorksharingSaveAsOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksharingSaveAsOptions Methods
WorksharingSaveAsOptions Class See Also
---
The WorksharingSaveAsOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
WorksharingSaveAsOptions Class
Autodesk.Revit.DB Namespace