# Control Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Control Properties
Control Class See Also
---
The Control type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Origin | The control origin. |
| Shape | The control shape. |
| View | The view. |

# See Also
Control Class
Autodesk.Revit.DB Namespace