# BuildingPadType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuildingPadType Members
BuildingPadType Class Methods Properties See Also
---
The BuildingPadType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateDefault | Creates a BuildingPadType element and adds it to the document. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ThermalProperties | The calculated and settable thermal properties of the BuildingPadType |

# See Also
BuildingPadType Class
Autodesk.Revit.DB Namespace