# EditorInteraction Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EditorInteraction Members
EditorInteraction Class Constructors Methods Properties See Also
---
The EditorInteraction type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EditorInteraction()()()() | Construct a default interaction. |
| EditorInteraction(EditorInteractionType) | Construct the interaction with the specified type. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InteractionType | The type of interaction. |

# See Also
EditorInteraction Class
Autodesk.Revit.UI Namespace