# BuildingEnvelopeAnalyzer Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuildingEnvelopeAnalyzer Methods
BuildingEnvelopeAnalyzer Class See Also
---
The BuildingEnvelopeAnalyzer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new analyzer. |
| Dispose |
| GetBoundingElements | Returns the collection of building elements exposed to the outside forming the building envelope. |
| GetBoundingElementsForSpaceVolume | Returns the collection of bounding building elements for an enclosed space volume. |
| GetCenterPointsForConnectedGridCellsInSpaceVolume | Returns the collection of connected cells in an enclosed space volume. |

# See Also
BuildingEnvelopeAnalyzer Class
Autodesk.Revit.DB.Analysis Namespace