# DocumentSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentSetIterator Properties
DocumentSetIterator Class See Also
---
The DocumentSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
DocumentSetIterator Class
Autodesk.Revit.DB Namespace