# AreaReinforcementCurve Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaReinforcementCurve Properties
AreaReinforcementCurve Class See Also
---
The AreaReinforcementCurve type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Curve | Returns the 3D curve forming part of the boundary of an Area Reinforcement element. |

# See Also
AreaReinforcementCurve Class
Autodesk.Revit.DB.Structure Namespace