# SplitButtonData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SplitButtonData Members
SplitButtonData Class Constructors Methods Properties See Also
---
The SplitButtonData type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SplitButtonData | Constructs a new instance of SplitButtonData. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
SplitButtonData Class
Autodesk.Revit.UI Namespace