# RebarCoverType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarCoverType Members
RebarCoverType Class Methods Properties See Also
---
The RebarCoverType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new CoverType in the document. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CoverDistance | A distance that can be used as a concrete cover value in a document. |

# See Also
RebarCoverType Class
Autodesk.Revit.DB.Structure Namespace