# TriangleInShellComponent Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TriangleInShellComponent Methods
TriangleInShellComponent Class See Also
---
The TriangleInShellComponent type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |

# See Also
TriangleInShellComponent Class
Autodesk.Revit.DB Namespace