# BoundingBoxContainsPointFilter Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BoundingBoxContainsPointFilter Properties
BoundingBoxContainsPointFilter Class See Also
---
The BoundingBoxContainsPointFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Point | The XYZ point to use when matching element bounding boxes. |
| Tolerance | Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements. |

# See Also
BoundingBoxContainsPointFilter Class
Autodesk.Revit.DB Namespace