# FilteredElementIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilteredElementIterator Methods
FilteredElementIterator Class See Also
---
The FilteredElementIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetCurrent | The current element found by the iterator. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next element passing the filter. |
| Reset | Resets the iterator to the beginning. |

# See Also
FilteredElementIterator Class
Autodesk.Revit.DB Namespace