# PolymeshFacet Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PolymeshFacet Methods
PolymeshFacet Class See Also
---
The PolymeshFacet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetVertices | Returns the three vertices that define this facet |
| ToString | Returns formatted string showing (V1, V2, V3) with values formatted as regular integers  (Overrides Object..::..ToString()()()().) |

# See Also
PolymeshFacet Class
Autodesk.Revit.DB Namespace