# DimensionSegmentArrayIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DimensionSegmentArrayIterator Methods
DimensionSegmentArrayIterator Class See Also
---
The DimensionSegmentArrayIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the array. |

# See Also
DimensionSegmentArrayIterator Class
Autodesk.Revit.DB Namespace