# DefinitionBindingMapIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefinitionBindingMapIterator Properties
DefinitionBindingMapIterator Class See Also
---
The DefinitionBindingMapIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the binding that is the current focus of the iterator. |
| Key | Retrieves the definition that is the current focus of the iterator. |

# See Also
DefinitionBindingMapIterator Class
Autodesk.Revit.DB Namespace