# SiteLocation Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SiteLocation Properties
SiteLocation Class See Also
---
The SiteLocation type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Elevation | The elevation of the site location. |
| GeoCoordinateSystemDefinition | The XML string which describes the geographic coordinate system. |
| GeoCoordinateSystemId | The geographic coordinate system ID, such as "AMG-50" and "Beijing1954/a.GK3d-40". |
| Latitude | The latitude of the site location. |
| Longitude | The longitude of the site location. |
| PlaceName | The place name of the site. |
| TimeZone | The time-zone for the site. |
| WeatherStationName | The name of the weather station at the site location. |

# See Also
SiteLocation Class
Autodesk.Revit.DB Namespace