# AssemblyDifference Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyDifference Members
AssemblyDifference Class Methods Properties See Also
---
The AssemblyDifference type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the AssemblyDifference |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
AssemblyDifference Class
Autodesk.Revit.DB Namespace