# StructuralSectionRound Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionRound Properties
StructuralSectionRound Class See Also
---
The StructuralSectionRound type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CentroidHorizontal | Distance from centroid to the left extremites along horizontal axis. |
| CentroidVertical | Distance from centroid to the upper extremites along vertical axis. |
| Diameter | Pipe Diameter. |
| NameKey | Name Key |

# See Also
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace