# FilterDoubleRule Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterDoubleRule Members
FilterDoubleRule Class Constructors Methods Properties See Also
---
The FilterDoubleRule type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterDoubleRule | Constructs an instance of FilterDoubleRule. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Epsilon | The tolerance within which two floating-point values may be considered equal. |
| RuleValue | The user-supplied value against which values from a Revit document will be tested. |

# See Also
FilterDoubleRule Class
Autodesk.Revit.DB Namespace