# ReferencePlane Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferencePlane Properties
ReferencePlane Class See Also
---
The ReferencePlane type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BubbleEnd | The bubble end of the reference plane. |
| Direction | The direction of the reference plane. |
| FreeEnd | The free end of the reference plane. |
| Name | The name property of the reference plane. |
| Normal | The normal vector of the reference plane. |

# See Also
ReferencePlane Class
Autodesk.Revit.DB Namespace