# PaperSizeSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PaperSizeSetIterator Properties
PaperSizeSetIterator Class See Also
---
The PaperSizeSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
PaperSizeSetIterator Class
Autodesk.Revit.DB Namespace