# GlobalParameter Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GlobalParameter Properties
GlobalParameter Class See Also
---
The GlobalParameter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsDrivenByDimension | Indicates whether this parameter is driven by a dimension or not. |
| IsDrivenByFormula | Indicates whether this parameter is driven by a formula or not. |
| IsReporting | Indicates whether this is a reporting global parameter or not. |

# See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace