# GeometryElement Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GeometryElement Methods
GeometryElement Class See Also
---
The GeometryElement type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetBoundingBox | Retrieves a box that encloses the geometry element. |
| GetEnumerator | Returns an enumerator that iterates through the collection. |
| GetEnumeratorNG | Returns an enumerator that iterates through the collection. |
| GetTransformed | Returns a transformed copy of the geometry in this element. |

# See Also
GeometryElement Class
Autodesk.Revit.DB Namespace