# AreaReinforcementType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaReinforcementType Members
AreaReinforcementType Class Methods Properties See Also
---
The AreaReinforcementType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateDefaultAreaReinforcementType | Creates a new AreaReinforcementType object with a default name. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
AreaReinforcementType Class
Autodesk.Revit.DB.Structure Namespace