# ElementArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementArray Properties
ElementArray Class See Also
---
The ElementArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets an element at a specified index within the array. |
| Size | Returns the number of elements that are in the array. |

# See Also
ElementArray Class
Autodesk.Revit.DB Namespace