# PipeScheduleType Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipeScheduleType Members
PipeScheduleType Class Methods Properties See Also
---
The PipeScheduleType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new pipe schedule type with the given name. |
| GetPipeScheduleId | Returns an existing pipe schedule type with the same name. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
PipeScheduleType Class
Autodesk.Revit.DB.Plumbing Namespace