# CurveArrArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveArrArray Properties
CurveArrArray Class See Also
---
The CurveArrArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets an item at a specified index within the array. |
| Size | Returns the number of objects that are in the array. |

# See Also
CurveArrArray Class
Autodesk.Revit.DB Namespace