# FilterStringRuleEvaluator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringRuleEvaluator Methods
FilterStringRuleEvaluator Class See Also
---
The FilterStringRuleEvaluator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Evaluate | Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not. |

# See Also
FilterStringRuleEvaluator Class
Autodesk.Revit.DB Namespace