# RevisionsOnSheetUIServiceData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevisionsOnSheetUIServiceData Methods
RevisionsOnSheetUIServiceData Class See Also
---
The RevisionsOnSheetUIServiceData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| GetParentHwnd | return the parent handle |
| GetRevitElementIds | return the list of revit Element Ids |

# See Also
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace