# TopographyEditScope Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TopographyEditScope Methods
TopographyEditScope Class See Also
---
The TopographyEditScope type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Start | Starts a topography surface edit mode for an existing TopographySurface element. |

# See Also
TopographyEditScope Class
Autodesk.Revit.DB.Architecture Namespace