# ElementSetIterator Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementSetIterator Members
ElementSetIterator Class Constructors Methods Properties See Also
---
The ElementSetIterator type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementSetIterator | For Internal Use Only. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MoveNext | Move the iterator one item forward. |
| Reset | Bring the iterator back to the start of the set. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
ElementSetIterator Class
Autodesk.Revit.DB Namespace