# ReferenceArray Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferenceArray Properties
ReferenceArray Class See Also
---
The ReferenceArray type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| Item | Gets or sets a reference at a specified index within the array. |
| Size | Returns the number of references that are in the array. |

# See Also
ReferenceArray Class
Autodesk.Revit.DB Namespace