# ExcessLengthFillBalusterId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterPattern..::..ExcessLengthFillBalusterId Property
BalusterPattern Class See Also
---
The id of a Baluster family used to fill excess length, which is the extra space along the railing segment that cannot be filled with a pattern. If set to InvalidElementId, it will be the default - the id of the BaseRailingAttr containing the Baluster pattern.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public ElementId ExcessLengthFillBalusterId { get; set; }
```

Visual Basic
---
```text
Public Property ExcessLengthFillBalusterId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ExcessLengthFillBalusterId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: Invalid ElementId for leftoverFill of BalusterPattern |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace