# BeamSystemType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BeamSystem..::..BeamSystemType Property
BeamSystem Class Example See Also
---
Retrieves or changes the type of the BeamSystem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BeamSystemType BeamSystemType { get; set; }
```

Visual Basic
---
```text
Public Property BeamSystemType As BeamSystemType
	Get
	Set
```

Visual C++
---
```text
public:
property BeamSystemType^ BeamSystemType {
	BeamSystemType^ get ();
	void set (BeamSystemType^ value);
}
```

# Examples
CopyC#
```text
public void GetInfo_BeamSystemType(BeamSystem beamSystem)
{
    string message = "BeamSystem : ";
    // Get BeamSystem type name
    message += "\nBeamSystem type name : " + beamSystem.BeamSystemType.Name;

    // Rename the BeamSystem type used by this BeamSystem
    beamSystem.BeamSystemType.Name = "TestBeamSystemTypeName";
    // Get BeamSystem type name
    message += "\nBeamSystem type name after set: " + beamSystem.BeamSystemType.Name;

    TaskDialog.Show("Revit",message);
}
```

CopyVB.NET
```text
Public Sub GetInfo_BeamSystemType(beamSystem As BeamSystem)
    Dim message As String = "BeamSystem : "
    ' Get BeamSystem type name
    message += vbLf & "BeamSystem type name : " & Convert.ToString(beamSystem.BeamSystemType.Name)

    ' Rename the BeamSystem type used by this BeamSystem
    beamSystem.BeamSystemType.Name = "TestBeamSystemTypeName"
    ' Get BeamSystem type name
    message += vbLf & "BeamSystem type name after set: " & Convert.ToString(beamSystem.BeamSystemType.Name)

    TaskDialog.Show("Revit", message)
End Sub
```

# See Also
BeamSystem Class
Autodesk.Revit.DB Namespace