# SetEndTreatmentTypeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..SetEndTreatmentTypeId Method
RebarShape Class Example See Also
---
Sets the EndTreatmentType id at the specified rebar shape end.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetEndTreatmentTypeId(
	ElementId endTreatmentId,
	int iEnd
)
```

Visual Basic
---
```text
Public Sub SetEndTreatmentTypeId ( _
	endTreatmentId As ElementId, _
	iEnd As Integer _
)
```

Visual C++
---
```text
public:
void SetEndTreatmentTypeId(
	ElementId^ endTreatmentId,
	int iEnd
)
```

# ### Parameters
endTreatmentId
    Type: Autodesk.Revit.DB..::..ElementId The id of an EndTreatmentType element, or invalidElementId if the rebar shape should have no end treatment at the specified end.
iEnd
    Type: System..::..Int32 0 for the start end treatment, 1 for the end end treatment.
# Examples
CopyC#
```text
# region Autodesk.Revit.DB.Structure.ReinforcementSettings
private bool SetEndTreatmentType(Document doc, RebarShape rebarShape)
{
    bool set = false;
    // check if end treatments are defined by rebar shape
    ReinforcementSettings settings = ReinforcementSettings.GetReinforcementSettings(doc);
    if (!settings.RebarShapeDefinesEndTreatments)
    {
        try
        {
            // can only be changed if document contains no rebars, area reinforcement or path reinforcement
            settings.RebarShapeDefinesEndTreatments = true;
        }
        catch (Exception e)
        {
            // cannot change the settings value
            TaskDialog.Show("Revit", e.Message);
        }
    }
    if (settings.RebarShapeDefinesEndTreatments)
    {
        EndTreatmentType treatmentType = EndTreatmentType.Create(doc, "Flame Cut");
        rebarShape.SetEndTreatmentTypeId(treatmentType.Id, 0);

        ElementId treatmentTypeId = EndTreatmentType.CreateDefaultEndTreatmentType(doc);
        rebarShape.SetEndTreatmentTypeId(treatmentTypeId, 1);

        set = true;
    }

    return set;
}
# endregion
```

CopyVB.NET
```text
# Region "Autodesk.Revit.DB.Structure.ReinforcementSettings"
Private Function SetEndTreatmentType(doc As Document, rebarShape As RebarShape) As Boolean
    Dim [set] As Boolean = False
    ' check if end treatments are defined by rebar shape
    Dim settings As ReinforcementSettings = ReinforcementSettings.GetReinforcementSettings(doc)
    If Not settings.RebarShapeDefinesEndTreatments Then
        Try
            ' can only be changed if document contains no rebars, area reinforcement or path reinforcement
            settings.RebarShapeDefinesEndTreatments = True
        Catch e As Exception
            ' cannot change the settings value
            TaskDialog.Show("Revit", e.Message)
        End Try
    End If
    If settings.RebarShapeDefinesEndTreatments Then
        Dim treatmentType As EndTreatmentType = EndTreatmentType.Create(doc, "Flame Cut")
        rebarShape.SetEndTreatmentTypeId(treatmentType.Id, 0)

        Dim treatmentTypeId As ElementId = EndTreatmentType.CreateDefaultEndTreatmentType(doc)
        rebarShape.SetEndTreatmentTypeId(treatmentTypeId, 1)

        [set] = True
    End If

    Return [set]
End Function
# End Region
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | iEnd not a valid shape end -or- the parameter endTreatmentId is not an EndTreatmentType element. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace