# CombinableElement Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CombinableElement Members
CombinableElement Class Methods Properties See Also
---
The CombinableElement type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Combinations | The geometry combinations that this element belongs to. |

# See Also
CombinableElement Class
Autodesk.Revit.DB Namespace