# LeaderArrayIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LeaderArrayIterator Properties
LeaderArrayIterator Class See Also
---
The LeaderArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
LeaderArrayIterator Class
Autodesk.Revit.DB Namespace