# DisplayingOptionsDialogEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DisplayingOptionsDialogEventArgs Members
DisplayingOptionsDialogEventArgs Class Methods Properties See Also
---
The DisplayingOptionsDialogEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddTab | Add tab to option dialog with tab name and handler information. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PagesCount | The count of pages in the options dialog (include the default pages added by Revit). |

# See Also
DisplayingOptionsDialogEventArgs Class
Autodesk.Revit.UI.Events Namespace