# AreaBasedLoadType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaBasedLoadType Methods
AreaBasedLoadType Class See Also
---
The AreaBasedLoadType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates an area based load type. |

# See Also
AreaBasedLoadType Class
Autodesk.Revit.DB.Electrical Namespace