# AssetSetIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetSetIterator Properties
AssetSetIterator Class See Also
---
The AssetSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current |

# See Also
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace