# StructuralSectionSigmaProfileWithLips Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionSigmaProfileWithLips Properties
StructuralSectionSigmaProfileWithLips Class See Also
---
The StructuralSectionSigmaProfileWithLips type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BendWidth | Bend segment width. |
| LipLength | Lip segment length. |
| MiddleBendLength | Middle Bend segment length. |
| TopBendLength | Top Bend segment length. |

# See Also
StructuralSectionSigmaProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace