# IModelExportContext Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IModelExportContext Members
IModelExportContext Interface Methods See Also
---
The IModelExportContext type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OnPoint|  This method is called when a Point is being output.
# See Also
IModelExportContext Interface
Autodesk.Revit.DB Namespace