# PhaseArrayIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PhaseArrayIterator Properties
PhaseArrayIterator Class See Also
---
The PhaseArrayIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Retrieves the item that is the current focus of the iterator. |

# See Also
PhaseArrayIterator Class
Autodesk.Revit.DB Namespace