# PointCloudColorSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudColorSettings Methods
PointCloudColorSettings Class See Also
---
The PointCloudColorSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Assign | Assigns values of the source settings to this object. |
| Dispose |
| IsEqual | Check if the contents of two settings are equal. |

# See Also
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace