# FabricationPartType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationPartType Methods
FabricationPartType Class See Also
---
The FabricationPartType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a fabrication part type element based on a specific fabrication servic button and condition. |
| Lookup | Looks up an existing fabrication part type based on a specfic fabrication service button and condition. |

# See Also
FabricationPartType Class
Autodesk.Revit.DB Namespace