# ElementClassFilter Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementClassFilter Methods
ElementClassFilter Class See Also
---
The ElementClassFilter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetElementClass | The class for the filter. |

# See Also
ElementClassFilter Class
Autodesk.Revit.DB Namespace