# WireConduitType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireConduitType Properties
WireConduitType Class See Also
---
The WireConduitType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Name |

# See Also
WireConduitType Class
Autodesk.Revit.DB.Electrical Namespace