# KeynoteEntries Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeynoteEntries Members
KeynoteEntries Class Methods Properties See Also
---
The KeynoteEntries type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LoadKeynoteEntriesFromFile | Loads the contents of a keynote text file into the provided KeyBasedTreeEntriesLoadContent. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |

# See Also
KeynoteEntries Class
Autodesk.Revit.DB Namespace