# StringParameterValue Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StringParameterValue Properties
StringParameterValue Class See Also
---
The StringParameterValue type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Value | The stored value |

# See Also
StringParameterValue Class
Autodesk.Revit.DB Namespace