# WireMaterialType Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireMaterialType Methods
WireMaterialType Class See Also
---
The WireMaterialType type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddGroundConductorSize | Add new electrical ground conductor size type into this material type. |
| AddTemperatureRatingType | Add a new temperature rating type into material type. |
| RemoveGroundConductorSize | Remove an existing ground conductor size from this material type. |
| RemoveTemperatureRatingType | Remove an existing temperature rating type from this material type. |

# See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace