# MEPSpaceConstruction Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPSpaceConstruction Methods
MEPSpaceConstruction Class See Also
---
The MEPSpaceConstruction type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DeleteConstruction | Remove an existing construction from Space constructions. |
| DuplicateConstruction | Create a new construction for Space constructions. |
| NewConstruction | Create a new construction for Space constructions. |

# See Also
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace