# FabricationHostedInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationHostedInfo Methods
FabricationHostedInfo Class See Also
---
The FabricationHostedInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DisconnectFromHost | Disconnects the part from the host. |
| Dispose |
| GetBearerCenterline | Gets the centerline of the bearer. The method is applicable only for bearer hanger. |
| PlaceOnHost(ElementId, Connector, Double) | Places the part on the specified host. |
| PlaceOnHost(ElementId, Connector, Double, Double) | Places the part on the specified host. |

# See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace